{
  "sources": "https://www.acluarkansas.org/sites/default/files/field_documents/236_0.pdf",
  "intro": {
    "title": "Protesters: Know Your Rights!",
    "text": "Although the right to peacefully protest is constitutionally protected, the definition of \"peaceful protest\" may differ from person to person. Here are some tips on what to do if you are confronted by a police officer or another public official during a protest. Keep this card handy! If you have an encounter with the police, you can protect yourself and your rights. If you believe that your rights have been violated, please contact an attorney and the ACLU."
  },
  "sections": [
    {
      "title": "Your Rights As a Protester",
      "subsections": [
        {
          "items": [
            "Protesters can express their opinions, even if unpopular",
            "Protesters exercising their rights in a public forum have the right to be protected by police from those attempting to interfere with their speech"
          ]
        },
        {
          "title": "Permits",
          "items": [
            "Protests can take place on public sidewalks and most public parks and plazas. The government may require a permit to regulate competing uses of the area and to ensure that reasonable time place and manner restrictions are respected.",
            "Protesters should not need a permit for demonstrations that don't present serious traffic, safety concerns, or competing-use concerns. Protesters should also not need a permit as long as the convenience of the public in use of streets and sidewalks would not be unduly disturbed."
          ]
        },
        {
          "title": "Places of Protest",
          "items": [
            "Public sidewalks and public parks, including public areas immediately adjacent to public streets are traditional public forums and speech there can only be restricted by reasonable time, place and manner restrictions.",
            "Other government space that has been opened up for speech must be publicly accessible for all public speech. Common examples of these designated public forums include public auditoriums, the steps of city hall, the state capitol and plazas in front of public buildings.",
            "Outdoor streets and plazas of public colleges and universities may require permits for non-university entities in some circumstances.",
            "Protests on private property are not usually protected unless you own or lease the property, or have permission of the owner. You can, however canvass door-to-door in residential areas unless the homeowner has posted a \"no solicitors\" sign."
          ]
        }
      ]
    },
    {
      "title": "Encounters With Police",
      "subsections": [
        {
          "items": [
            "What you say to the police is always important. What you say can be used against you, and it can give the police an excuse to arrest you – especially if you \"bad mouth\" an officer. Try not to escalate any situation.",
            "State law says you must identify yourself to a law enforcement officer upon request. However, police can't legally arrest you for refusing to provide your name unless you are suspected of criminal activity, or your identification is needed to protect officer safety or resolve whatever reasonable suspicions prompted the stop. If you reasonably fear that your name is incriminating, you can claim the right to remain silent, which may be a defense in case you are arrested anyway.",
            "Police can ask your name if you have been properly detained.",
            "If asked for your identity, you must use your discretion as to whether you wish to refuse, to ask the law enforcement purpose behind the request, or to comply.",
            "You do not have to consent to a search of yourself, or your belongings or car."
          ]
        }
      ]
    },
    {
      "title": "Limitations on Speech",
      "subsections": [
        {
          "items": [
            "The government can limit speech by imposing \"time, place, and manner\" restrictions. This is most commonly done by requiring permits for meetings, rallies, and larger demonstrations.",
            "The First Amendment does not protect speech that incites violence or is threatening",
            "It is a federal crime to threaten to harm the President, the Vice President, or a major candidate for either office."
          ]
        }
      ]
    },
    {
      "title": "Limitations on Action",
      "subsections": [
        {
          "items": [
            "If you endanger others through the manner in which you choose to protest, you can be arrested. A protest that blocks traffic is illegal without a permit.",
            "Protesters who do not have a permit should stick to public sidewalks and be sure not to obstruct the flow of pedestrian or other traffic.",
            "You do have the right to distribute literature, chant, and engage passersby in debate, but you do not have the right to block a building entrance or physically harass people.",
            "Protesting on private property is not protected by the law.",
            "You can videotape but do not interfere with police.",
            "Avoid carrying any alcohol, drugs or weapons. If you happen to be arrested you could face additional charges for their possession."
          ]
        }
      ]
    },
    {
      "title": "If You Are Arrested",
      "subsections": [
        {
          "items": [
            "Do not run or resist even if you believe the arrest is unlawful. It may result in additional charges.",
            "The whole process, from arrest to release on bail, can take up to 48 hours, or more on holidays.",
            "If you qualify financially and your potential sentence includes jail or prison time, a public defender should be appointed for you at your arraignment.",
            "You can hire an attorney to represent you at the arraignment and, if you have not already been released or paid bail, present arguments regarding bail.",
            "If you must attend court for your bail, the judge will set bail according to several factors (local connections, seriousness of the crime, how many other protesters have been arrested, etc.)."
          ]
        }
      ]
    },
    {
      "title": "For More Information",
      "content": [
        "A copy of other Know Your Rights materials is available on our webpage, including a complete KYR Protest guide entitled, \"Free Speech, Protests, and Demonstrations in the State of Arkansas: An Activist's Guide,\" and also our \"KYR When Encountering Police\" Guide and corresponding KYR pocket card."
      ]
    }
  ]
}
