{
  "sources": "https://www.acluaz.org/en/rights-protesters",
  "intro": {
    "title": "Rights of Protesters",
    "text": "You have a constitutionally protected right to engage in peaceful protest in \"traditional public forums\" such as streets, sidewalks or public parks. However, the government can impose \"time, place and manner\" restrictions on speech; for example, the government may require permits for large protests or prohibit unreasonably loud demonstrations that disturb others."
  },
  "sections": [
    {
      "title": "Your Right to Protest",
      "content": [
        "You have a constitutionally protected right to engage in peaceful protest in \"traditional public forums\" such as streets, sidewalks or public parks. However, the government can impose \"time, place and manner\" restrictions on speech; for example, the government may require permits for large protests or prohibit unreasonably loud demonstrations that disturb others. These restrictions are generally permissible as long as they are reasonable and not based on content. The government cannot impose permit restrictions simply because it does not like the message of a certain speaker or group.",
        "If for example, you are planning a parade that involves closing down streets, a permit is almost always required. But a small march that stays on public sidewalks and obeys all traffic signals often does not require a permit. Make sure to inquire about city or county ordinances that regulate First Amendment activities. In the City of Phoenix, permits may be obtained from the city manager (City Manager Office, Phoenix City Hall, 200 W. Washington St 12th Floor, AZ 85003). However, policies vary by city, so be sure to check your local regulations in advance.",
        "Generally, you have the right to distribute literature, hold signs, and collect petition signatures while on sidewalks or in front of government buildings as long as you are not disrupting other people or government proceedings, forcing passersby to accept leaflets or causing traffic problems.",
        "You have the right to set up tables on public sidewalks and solicit donations, as long as the walkway is not blocked. Check for municipal restrictions on setup times or booth locations. Drumming, dancing, singing, and chanting are all protected First Amendment activities. Street performers, mimes, or puppeteers also have the right to express themselves in public, subject to reasonable conditions. In order to put on an event involving a large group of people and the use of public facilities or amplified sound, you will need a permit. (Make sure to ask about noise ordinances and a noise ordinance waiver if necessary)."
      ],
      "subsections": [
        {
          "items": [
            "Contact the Arizona Legislative Council office for application and more information."
          ]
        }
      ]
    },
    {
      "title": "Limitations on Speech",
      "subsections": [
        {
          "items": [
            "The First Amendment does not protect speech that is combined with the violation of established laws such as trespassing or disobeying a lawful order by a police officer.",
            "Although inflammatory speakers cannot be punished for merely arousing an audience or advocating a violation of the law, a speaker can be arrested for inciting imminent violence.",
            "Also unprotected are malicious false statements about public officials and obscene speech."
          ]
        }
      ]
    },
    {
      "title": "Limitations on Action",
      "subsections": [
        {
          "items": [
            "Demonstrators who engage in civil disobedience — peaceful, but unlawful, activities as a form of protest — are not protected under the First Amendment and can be arrested.",
            "If you endanger others while protesting, you can be arrested. A protest that blocks vehicular or pedestrian traffic is illegal without a permit.",
            "You do not have the right to block a building entrance or physically harass people. The general rule is that free speech activity cannot take place on private property, including malls, without the consent of the property owner. You do not have the right to remain on private property after being told to leave by the property owner."
          ]
        }
      ]
    },
    {
      "title": "Free Speech for Immigrants",
      "subsections": [
        {
          "items": [
            "Constitutional rights, including First Amendment protections, apply to all residents of the U.S. regardless of immigration status.",
            "If you are not a permanent resident and get arrested while attending a protest, your arrest can have a negative impact on your application for residency. For example, a felony charge and some misdemeanors can lead to deportation even if you were engaging in activities that were protected by the First Amendment.",
            "Immigrants who choose to engage in a protest, march or demonstration should memorize the telephone numbers of friends and relatives, as well as the telephone numbers of an immigration attorney or an advocacy organization."
          ]
        }
      ]
    },
    {
      "title": "Free Speech for Immigrant Workers",
      "subsections": [
        {
          "items": [
            "Local, state, and federal governments are prohibited from restricting your rights to free speech under the First Amendment of the U.S. Constitution."
          ]
        }
      ]
    }
  ]
}
