{
  "sources": "https://www.aclum.org/en/know-your-rights/know-your-rights-general-guidance-demonstrations-and-protests",
  "intro": {
    "title": "Know Your Rights: General Guidance for Demonstrations and Protests",
    "text": "The right to join with others in protest and peaceful assembly is critical to a functioning democracy. This right is protected by the Massachusetts Constitution and the First Amendment. But it is also unfortunately true that governments and police can violate this right through the use of mass arrests, illegal use of force, criminalization of protest, and other means intended to thwart free public expression. Knowing your rights is the most powerful tool you have against a violation of those rights. Here's what you need to know before heading out to exercise your constitutionally protected right to protest."
  },
  "sections": [
    {
      "title": "Do I have a right to protest or demonstrate on public property in Massachusetts?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Yes. Freedom of speech and assembly — which are fundamental to the functioning of democracy in America — are protected by both the First Amendment to the U.S. Constitution and Articles 16 and 19 of the Massachusetts Declaration of Rights."
          ]
        }
      ]
    },
    {
      "title": "Where can I protest in Massachusetts?",
      "subsections": [
        {
          "title": "",
          "items": [
            "You have a right to engage in free speech and to assemble with others in \"traditional public forums,\" such as public streets, sidewalks, and parks, as well as other public places, like plazas in front of government buildings, where assembly and speech are generally allowed.",
            "You can also engage in freedom of expression on private property with permission of the private property owner. In Massachusetts, the state constitution has been interpreted to allow for some types of petitioning on certain kinds of private property even without the permission of the property owner; this right currently applies to the collection of signatures for a candidate or ballot questions to get on the ballot at shopping centers that are central gathering places in the area. The state's highest court has left open the possibility that there is a more general right of free speech at shopping malls or on other types of private property, such as property where the owner has invited the public to visit."
          ],
          "link": {
            "text": "See Batchelder v. Allied Stores, Inc., 388 Mass. 83, 91-92 (1983)",
            "url": "https://scholar.google.com/scholar_case?case=15926107890299410722"
          }
        }
      ]
    },
    {
      "title": "Can the government limit when, where, or how I protest?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Yes. The government can have \"reasonable time, place, or manner\" rules that limit, for instance, the times of day, specific locations, and noise levels of a protest. Such rules, can prevent blocking others from using sidewalks or streets for their intended purpose, or blocking access to government or private buildings. Some of these rules may apply even on private property, such as noise limits that may be different depending on the neighborhood or time of day you are demonstrating. Check for local laws that apply prior to starting your demonstration."
          ]
        }
      ]
    },
    {
      "title": "Can the government restrict my demonstration because they do not like the message I am expressing?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Generally, NO — unless your message is not protected by state or federal constitutions, for instance, because it is intended to incite imminent violence or convey a threat of physical harm. Other than in the rare situations where your speech is not protected at all, the government may not treat demonstrators differently because of the message they seek to communicate. For example, those demonstrating for police reform should not be treated any differently than those demonstrating in favor of the police. Such \"content-based discrimination\" is not allowed; rules that are \"content-based\" do not qualify as reasonable time, place, or manner restrictions."
          ]
        }
      ]
    },
    {
      "title": "Do I need a permit before I engage in a protest or demonstration on public property?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Not usually, but the government can legally require permits in certain situations, such as when:",
            "A march or parade will require street closure or will block vehicle or pedestrian traffic.",
            "A rally is expected to be very large, usually 100 people or more.",
            "The event will involve substantial sound amplification.",
            "In these situations, a permit can be required because of the potential disruption of other activities or because public safety services, including police protection, may be required. Check your local rules.",
            "A reasonable fee can be charged to cover the administrative costs of processing the permit application, but there should be a process to get the fee waived where an event sponsor cannot afford it. Many communities will require permit applicants to pay for police details or provide insurance coverage. We believe it is illegal for government to charge event sponsors for the cost of providing public safety services in traditional public forums or to require sponsors to provide insurance coverage for any conduct over which they do not have control, such as the conduct of counter-protestors."
          ],
          "link": {
            "text": "public safety services",
            "url": "https://www.aclum.org/en/know-your-rights/know-your-rights-free-speech-protests-demonstrations"
          }
        }
      ]
    },
    {
      "title": "What is the proper role of the police at a demonstration?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Police can be present to protect protestors, any counter-protestors, and the general public; ensure traffic safety; and generally, keep the peace. This may involve keeping protestors and counter-protestors separate or setting up an area that no one can go into without being searched for items that can be used as weapons, including for example sticks that are used to carry a sign. Such areas should not be so large that those who choose not to be searched cannot hear and participate in the demonstration. If you choose to go into this area, your bags and pockets can be searched; however, police should not treat people differently based on the viewpoints being expressed."
          ]
        }
      ]
    },
    {
      "title": "Do I have the right to take pictures or record the police at demonstrations?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Yes. You have the right to take pictures of anything that is plainly visible from a public location, including the police, and in Massachusetts you can even record the voices of police in public spaces such as streets, sidewalks and parks without their knowledge or consent. But you should not do so in a way that actually interferes with law enforcement activities, even if you think what the police are doing is wrong, as this can lead to your arrest."
          ],
          "link": {
            "text": "See, e.g., Project Veritas Action Fund v. Rollins, 982 F.3d 813 (1st Cir. 2020)",
            "url": "https://scholar.google.com/scholar_case?case=10442736581312534945"
          }
        }
      ]
    },
    {
      "title": "Can the police order a demonstration to end?",
      "subsections": [
        {
          "title": "",
          "items": [
            "If a protest or counter-protest is turning violent, police can order everyone to leave, but this should be a last resort. If you are ordered to disperse and do not, you can be arrested. And if the event has received a permit for only a set amount of time, police can ask people to leave at the end of that time."
          ],
          "link": {
            "text": "G.L. c. 269, § 1",
            "url": "https://malegislature.gov/Laws/GeneralLaws/PartIV/TitleI/Chapter269/Section1"
          }
        }
      ]
    },
    {
      "title": "What do I do if I get stopped by the police?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Stay calm. Don't argue, resist, or obstruct the police, even if you believe they are violating your rights. Make sure to keep your hands visible so they don't think you are reaching for a weapon. You have a right to ask for the officers to provide their names and badge numbers in case you want to make a complaint later. Ask if you are free to leave. If the officer says yes, calmly walk away. For information about when you have to identity yourself to police, see this Know Your Rights.",
            "If you are under arrest, you can ask why and say you want a lawyer. Otherwise, you should remain silent. Don't say anything or sign anything without a lawyer. Once at the police station, you have the right to make a local phone call, and if you're calling your lawyer, police are not allowed to listen."
          ],
          "link": {
            "text": "Know Your Rights",
            "url": "https://www.aclum.org/en/know-your-rights/know-your-rights-when-encountering-police"
          }
        }
      ]
    }
  ]
}
