{
    "sources": "https://www.aclualabama.org/en/know-your-rights/demonstrations-and-protests",
    "intro": {
      "title": "Know Your Rights: Demonstrations and Protests",
      "text": "The First Amendment protects your right to assemble and express your views through protest. But it is also unfortunately true that governments and police can violate this right – through the use of mass arrests, illegal use of force, criminalization of protest, and other means intended to thwart free public expression."
    },
    "sections": [
      {
        "title": "I'm organizing a protest",
        "subsections": [
          {
            "title": "Your rights",
            "items": [
              "Your rights are strongest in what are known as \"traditional public forums,\" such as streets, sidewalks, and parks. You also likely have the right to speak out on other public property, like plazas in front of government buildings, as long as you are not blocking access to the government building or interfering with other purposes the property was designed for.",
              "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
              "Counterprotesters also have free speech rights. Police must treat protesters and counterprotesters equally. Police are permitted to keep antagonistic groups separated but should allow them to be within sight and sound of one another.",
              "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. On private property, the owner may set rules related to photography or video."
            ]
          },
          {
            "title": "Do I need a permit?",
            "items": [
              "Normally, you don't need a permit to march or gather on sidewalks or public parks, as long as marchers don't obstruct car or pedestrian traffic. If you don't have a permit, police officers can ask you to move to let others pass or for safety reasons.",
              "Currently, some cities in Alabama have restricted protest to certain times and locations. Make sure you research and confirm if your city currently has a curfew.",
              "Certain types of events may require permits. These include a march or parade that requires blocking traffic or street closure; a large rally requiring the use of sound-amplifying devices; or a rally over a certain size at most parks or plazas.",
              "While certain permit procedures require submitting an application well in advance of the planned event, police can't use those procedures to prevent a protest in response to breaking news events.",
              "Restrictions on the route of a march or sound equipment might violate the First Amendment if they are unnecessary for traffic control or public safety, or if they interfere significantly with effective communication to the intended audience.",
              "A permit cannot be denied because the event is controversial or will express unpopular views.",
              "If the permit regulations that apply to your protest require a fee for a permit, they should allow a waiver for those who cannot afford the charge."
            ]
          },
          {
            "title": "What to do if you believe your rights have been violated",
            "items": [
              "When you can, write down everything you remember, including the official's information and the agency they work for.",
              "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board.",
              "If you face difficulty obtaining a permit or believe your permit was denied unjustly, contact us HERE"
            ]
          }
        ]
      },
      {
        "title": "I'm attending a protest",
        "subsections": [
          {
            "title": "Your rights",
            "items": [
              "Your rights are strongest in what are known as \"traditional public forums,\" such as streets, sidewalks, and parks. You also likely have the right to speak out on other public property, like plazas in front of government buildings, as long as you are not blocking access to the government building or interfering with other purposes the property was designed for.",
              "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
              "Counterprotesters also have free speech rights. Police must treat protesters and counterprotesters equally. Police are permitted to keep antagonistic groups separated but should allow them to be within sight and sound of one another.",
              "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. On private property, the owner may set rules related to photography or video.",
              "Usually, you don't need a permit to march or protest on sidewalks, as long as marchers don't obstruct car or pedestrian traffic. However, under the First Amendment, the government may restrict the time, place, and manner of protest in a limited fashion.",
              "If you don't have a permit, police officers can ask you to move to let others pass or for safety reasons."
            ]
          },
          {
            "title": "What happens if the police issues an order to disperse the protest?",
            "items": [
              "Shutting down a protest through a dispersal order must be law enforcement's last resort. Police may not break up a gathering unless there is a clear and present danger of riot, disorder, interference with traffic, or other immediate threat to public safety.",
              "If officers issue a dispersal order, they must provide a reasonable opportunity to comply, including sufficient time and a clear, unobstructed exit path.",
              "Individuals must receive clear and detailed notice of a dispersal order, including how much time they have to disperse, the consequences of failing to disperse, and what clear exit route they can follow, before they may be arrested or charged with any crime."
            ]
          },
          {
            "title": "What to do if you believe your rights have been violated",
            "items": [
              "When you can, write down as much as you can about the events that occurred—the who, what, where, when, and how — especially regarding violence or law enforcement misconduct. Note any potential violations of your rights, such as if law enforcement did not give you a reasonable time to disperse. Try to write down the officers' badge and patrol car numbers and the agency they work for.",
              "Consider telling another person what happened as soon as you can to corroborate your experience.",
              "Get contact information for witnesses.",
              "Take photographs and/or videos of any violence, law enforcement misconduct, and any injuries. Although police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances, you may consider sending photos or videos to a friend.",
              "Contact us HERE to help the ACLU's efforts to document policies and practices of police violence and oppression of protestors in Alabama."
            ]
          }
        ]
      },
      {
        "title": "I want to take pictures or shoot video at a protest",
        "subsections": [
          {
            "title": "Your rights",
            "items": [
              "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. (On private property, the owner may set rules about photography or video.)",
              "Although police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances, you may consider sending photos or videos to a friend. However, law enforcement may order citizens to cease activities that are truly interfering with legitimate law enforcement operations. If you are videotaping, be aware that there is an important legal distinction between a visual photographic record (fully protected) and the audio portion of a videotape, which some states have tried to regulate under state wiretapping laws."
            ]
          },
          {
            "title": "What to do if you are stopped or detained for taking photographs",
            "items": [
              "Always remain calm and never physically resist a police officer.",
              "Police cannot detain you without reasonable suspicion that you have or are about to commit a crime or are in the process of doing so.",
              "If you are stopped, ask the officer if you are free to leave. If the answer is yes, calmly walk away.",
              "If you are detained, ask the officer what crime you are suspected of committing, and remind the officer that taking photographs is your right under the First Amendment and does not constitute reasonable suspicion of criminal activity."
            ]
          },
          {
            "title": "What to do if you believe your rights have been violated",
            "items": [
              "When you can, write down as much as you can about the events that occurred—the who, what, where, when, and how. Try to write down the officers' badge and patrol car numbers and the agency they work for.",
              "Consider telling another person what happened as soon as you can to corroborate your experience.",
              "Get contact information for witnesses.",
              "Take photographs of any injuries.",
              "Contact us HERE to help the ACLU's efforts to document policies and practices of police violence and oppression of protestors in Alabama.",
              "Once you have all of this information, you can file a written complaint with the agency in question's internal affairs division or civilian complaint board."
            ]
          }
        ]
      },
      {
        "title": "I was stopped by the police while protesting",
        "subsections": [
          {
            "title": "Your rights",
            "items": [
              "Stay calm. Make sure to keep your hands visible. Don't argue, resist, or obstruct the police, even if you believe they are violating your rights. Point out that you are not disrupting anyone else's activity and that the First Amendment protects your actions.",
              "If you want to avoid being arrested, follow law enforcement directions to disperse or leave the area.",
              "Ask if you are free to leave. If the officer says yes, calmly walk away.",
              "Unless you are suspected of criminal activity, you do not need to give law enforcement your name or a form of identification. But do not give false information to law enforcement, as it may be a crime or could affect you later in court.",
              "You never have to consent to a search of yourself or your belongings, including bags or your phone. If you do explicitly consent, it can affect you later in court.",
              "Police may \"pat down\" your clothing if they suspect you have a weapon and may search you after an arrest.",
              "Police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances. However, they may order citizens to cease activities that are truly interfering with legitimate law enforcement operations."
            ]
          },
          {
            "title": "What to do if you believe your rights have been violated",
            "items": [
              "When you can, write down as much as you can about the events that occurred — the who, what, where, when, and how — especially regarding violence or law enforcement misconduct. Note any potential violations of your rights, such as if law enforcement did not give you a reasonable time to disperse. Try to write down the officers' badge and patrol car numbers and the agency they work for.",
              "Consider telling another person what happened as soon as you can to corroborate your experience.",
              "Get contact information for witnesses.",
              "Take photographs and/or videos of any violence, law enforcement misconduct, and any injuries. Although police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances, you may consider sending photos or videos to a friend.",
              "Contact us HERE to help the ACLU's efforts to document policies and practices of police violence and oppression of protestors in Alabama.",
              "Once you have all of this information, you can file a written complaint with the agency in question's internal affairs division or civilian complaint board.",
              "If you were arrested, see the section \"I was arrested at a protest\" below."
            ]
          }
        ]
      },
      {
        "title": "I was arrested at a protest",
        "subsections": [
          {
            "title": "Your rights",
            "items": [
              "If you are under arrest, you have a right to ask why. Otherwise, say you wish to remain silent and ask for a lawyer immediately. Don't say anything or sign anything without a lawyer.",
              "Police may \"pat down\" your clothing if they suspect you have a weapon and may search you after an arrest.",
              "You never have to consent to a search of yourself or your belongings, including bags or your phone. If you do explicitly consent, it can affect you later in court."
            ]
          },
          {
            "title": "What to do if you believe your rights have been violated",
            "items": [
              "When you can, write down as much as you can about the events that occurred — the who, what, where, when, and how—especially regarding violence or law enforcement misconduct. Note any potential violations of your rights, such as if law enforcement did not give you a reasonable time to disperse. Try to write down the officers' badge and patrol car numbers and the agency they work for.",
              "Consider telling another person what happened as soon as you can to corroborate your experience.",
              "Get contact information for witnesses.",
              "Take photographs and/or videos of any violence, law enforcement misconduct, and any injuries. Although police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances, you may consider sending photos or videos to a friend.",
              "Contact us HERE to help the ACLU's efforts to document policies and practices of police violence and oppression of protestors in Alabama.",
              "Once you have all of this information, you can file a written complaint with the agency in question's internal affairs division or civilian complaint board."
            ]
          },
          {
            "title": "The consequences of being arrested or convicted",
            "items": [
              "If you are released on bail, you must appear at your next hearing. Failure to do so could result in fines or incarceration.",
              "If you plead guilty to or are convicted of a crime, it will go on your criminal record.",
              "Arrests and convictions, even for misdemeanors, may affect your future. For example, you may need to disclose arrests or convictions on a bar application to become a lawyer or to obtain a security clearance for government or military jobs.",
              "Convictions may also limit your ability to bring legal claims for the deprivation of your constitutional rights."
            ]
          }
        ]
      },
      {
        "title": "The government harmed me or otherwise violated my rights during a protest. What is my legal recourse?",
        "content": [
          "If the government violated your constitutional rights, you may be able to bring a legal action for damages against the specific officer/official or city/municipality that violated your rights. These legal actions are called \"Section 1983\" suits. Examples of Section 1983 claims for deprivation of constitutional rights during or after protests include claims for excessive force, kettling (corralling and detaining protestors), or unsafe or unsanitary conditions in jail after arrest.",
          "However, substantial obstacles exist to these suits. The doctrine of qualified immunity prevents individual officers or officials from paying damages if their actions were not \"clearly established\" as unconstitutional. This sweeping rule often precludes damages in all but the most egregious situations.",
          "Suits against government entities likewise are difficult to bring. Under *Monell v. Department of Social Services of New York*, a municipality is liable for the deprivation of constitutional rights only if the municipality has a policy, practice, or custom of such deprivation.",
          "The ACLU is documenting police violence and government oppression of protestors to establish whether municipalities have such policies, procedures, and customs. This information may be used as evidence in future legal actions. Contact the ACLU of Alabama at legal@aclualabama.org to report your experiences with police violence or other constitutional violations during protests.",
          "Moreover, a Section 1983 case may not be brought until any related criminal action has concluded. For example, a protestor arrested for violating a curfew may not bring a suit for excessive force against the arresting officer until the criminal curfew case is over.",
          "At this time, the ACLU of Alabama currently is unable to bring Section 1983 lawsuits on behalf of individuals whose constitutional rights were violated during or after protests."
        ]
      },
      {
        "title": "I want to protect and strengthen the right to protest in the future",
        "content": [
          "The ACLU fully supports taking legal action against governments that violate the constitutional rights of protestors. Litigation is not always the best or fastest way to make change, however. Lawsuits aimed at systemic change are often years long; they can't solve problems that may occur during protests next week. And even if a court decides that a municipality violated the constitutional rights of its citizens in the past, that ruling may not apply to similar, but not identical, unconstitutional conduct or apply to other areas in Alabama.",
          "But you can take action on your own or in coordination with groups such as the ACLU to protect and strengthen the right to protest in the future.",
          "Contact these local grassroots organizations who are organizing around pressuring your local officials such as your mayor or members of the city council.",
          "Birmingham: Black Lives Matter Birmingham, www.facebook.com/blmbirmingham",
          "Huntsville: The Citizens Coalition for Criminal Justice Reform, theunitedwoc@gmail.com",
          "Montgomery: Southerners on New Ground Montgomery, www.facebook.com/groups/songmgm",
          "Reforms activists may be asking cities to do are one or all of the following:",
          "Reduce or eliminate the use of military-grade weapons and equipment. These lethal instruments should not be deployed against any civilian, much less peaceful protestors.",
          "Eliminate the use of chemical weapons against protestors.",
          "Establish civilian review boards to oversee police misconduct.",
          "Be more transparent about government plans and policies regarding protests, including law enforcement plans.",
          "Be more transparent about police policies in general. Make public complaints against law enforcement for use of excessive force or other constitutional violations."
        ]
      }
    ]
  }
