{
  "sources": "https://www.acluohio.org/en/know-your-rights/protesters-know-your-rights",
  "intro": {
    "title": "Protesters: Know Your Rights!",
    "text": "Although the right to peacefully protest is constitutionally protected, the definition of \"peaceful protest\" may differ from person to person. Here are some valuable tips on what to do if you are confronted by a police officer or another public official during a protest. Bookmark this page! If you have an encounter with the police, you can protect yourself and your rights. If you believe that your rights have been violated, please contact an attorney."
  },
  "sections": [
    {
      "title": "Your Rights as a Protester",
      "subsections": [
        {
          "title": "Your rights",
          "items": [
            "You have the First Amendment right to peacefully assemble to protest.",
            "You can protest in public spaces, such as streets, sidewalks, and parks so long as you aren't blocking traffic. If anticipating a group large enough to block pedestrian or car traffic, contact your municipal government for more information.",
            "You can protest without a permit in response to recent events. Check local laws for restrictions.",
            "You have the right to distribute literature, chant, and engage passersby in debate in public spaces without a permit.",
            "You can photograph or videotape the police."
          ]
        }
      ]
    },
    {
      "title": "Keep in Mind",
      "subsections": [
        {
          "title": "What to remember when interacting with authorities",
          "items": [
            "What you say to the police is always important. What you say can be used against you, and it can give the police an excuse to arrest you.",
            "You are required to provide your name, address, or date of birth to a law enforcement officer upon request. You can be arrested for refusing to identify yourself to an officer.",
            "You do not have to consent to a search of yourself or your car."
          ]
        }
      ]
    },
    {
      "title": "Limitations on Speech",
      "subsections": [
        {
          "title": "Legal restrictions on protest speech",
          "items": [
            "The government can limit speech by imposing \"time, place, and manner\" restrictions. This is most commonly done by requiring permits for meetings, rallies, and demonstrations.",
            "The First Amendment does not protect speech that incites violence, is obscene, or is threatening",
            "It is a federal crime to threaten to harm the president, the vice president, or a major candidate for either office."
          ]
        }
      ]
    },
    {
      "title": "Limitations on Action",
      "subsections": [
        {
          "title": "Prohibited protest activities",
          "items": [
            "If you endanger others through the manner in which you choose to protest, you can be arrested. A protest that blocks traffic generally requires a permit.",
            "You do not have the right to block a building entrance or physically harass people.",
            "Protesting on private property is not protected by the law. You can be arrested if trespassing.",
            "Do not interfere with, touch or verbally antagonize the police.",
            "Avoid carrying any drugs or weapons. If you happen to be arrested, you could face additional charges for their possession."
          ]
        }
      ]
    },
    {
      "title": "If You Are Arrested",
      "subsections": [
        {
          "title": "What to expect during arrest and processing",
          "items": [
            "Do not run or resist. It may result in additional charges.",
            "The whole process, from arrest to release on bail, should take about 24-36 hours.",
            "The police will ask you for basic biographical information and will take your fingerprints and photograph, unless you have been charged with a very minor crime.",
            "You will then be interviewed by a court agency so that bail can be assessed. You do not have to answer their questions, but giving accurate information will speed the process.",
            "You can hire an attorney to represent you at the arraignment and present arguments regarding bail.",
            "The judicial officer will set bail according to several factors (local connections, seriousness of the crime, how many other protesters have been arrested, etc.).",
            "There are three main types of crimes that you could be charged with. They are, from least to most severe, a minor misdemeanor, a misdemeanor offense, and a felony offense."
          ]
        },
        {
          "title": "If you believe your rights have been violated",
          "items": [
            "If you feel your rights have been violated, write down everything you can remember, including officers' badge and patrol car numbers, which agency the officers were from, and any other details. Get contact information for witnesses."
          ]
        }
      ]
    }
  ]
}
