{
  "sources": "https://www.aclu-mo.org/en/know-your-rights/your-rights-protest",
  "intro": {
    "title": "Your Rights at a Protest",
    "text": "The First Amendment protects many forms of expression including the right to free speech participating in demonstrations like protests and marches leafleting chanting drumming and dancing. It also protects \"symbolic speech\" e.g. wearing T-shirts with messages carrying signs sculptures or puppets etc."
  },
  "sections": [
    {
      "title": "Are there limits on what I can say?",
      "content": [
        "The First Amendment broadly protects speech including controversial viewpoints and criticism of virtually anything including government officials but there are limits. You can be arrested for encouraging \"imminent\" violence or other immediate illegal activities that threaten harm to people or property. It's a federal crime to threaten to harm the President or Vice President."
      ]
    },
    {
      "title": "Can violence or property destruction ever be constitutionally protected?",
      "content": [
        "No. Violence or criminal activity does not become constitutional simply because you do it while expressing a political message."
      ]
    },
    {
      "title": "Where can I exercise my speech rights?",
      "content": [
        "On any private property where the owner gives permission (the owner always decides) and in any area open to the public such as streets sidewalks town squares or parks. If you plan to or actually block passage on a street or sidewalk you must apply for a permit."
      ]
    },
    {
      "title": "Can I approach other people in public areas?",
      "content": [
        "Yes. You may approach pedestrians with leaflets newspapers petitions and requests for donations. But you cannot prevent people from getting by or walking away and should leave them alone if asked to do so. You cannot block building entrances."
      ]
    },
    {
      "title": "Can I heckle other speakers?",
      "content": [
        "Yes unless you attempt to physically disrupt an event or drown out other speakers. If speakers have a permit to use a public space hecklers may be required to stand outside that area. Police may keep two opposing groups separated but should allow them to be within the same general area."
      ]
    },
    {
      "title": "What should I do if I am ordered to disperse?",
      "content": [
        "Missouri's \"Refusal to Disperse\" law is speech protective. No police officer should give an order to \"disperse\" unless someone is at a \"riot\" or \"the scene of an unlawful assembly\" (i.e. \"six or more people assemble and agree to violate criminal laws with force or violence\"). If you are at such a scene you must first be given an order to disperse. You must obey such an order. If you do not do so you may be arrested even if you are not committing acts of violence."
      ]
    },
    {
      "title": "Is civil disobedience constitutionally protected?",
      "content": [
        "No. Civil disobedience - peaceful but unlawful activities as a form of protest - can legally be (and often is) prosecuted. You may be arrested. Make arrangements with a lawyer in advance."
      ]
    },
    {
      "title": "Can I record or photograph police in public?",
      "content": [
        "Yes."
      ]
    },
    {
      "title": "Can police legally attend a protest undercover?",
      "content": [
        "Yes. And you should be aware that they may try to attend planning meetings to learn about plans for illegal activity."
      ]
    },
    {
      "title": "Can police search demonstrators?",
      "content": [
        "If police have reasonable suspicion that you are involved in or about to commit criminal activity they can frisk your outer clothing to search for weapons."
      ]
    },
    {
      "title": "Can police search bags and containers without probable cause?",
      "content": [
        "Yes if you are entering what has been marked a secure area. But you can refuse and should be allowed to leave. Otherwise police can only search bags if they have probable cause that it contains contraband weapons or evidence of illegal activity."
      ]
    }
  ]
}
