{
    "sources": [
      "Organizing: https://www.aclukansas.org/en/im-organizing-protest",
      "Attending: https://www.aclukansas.org/en/im-attending-protest"
    ],
    "intro": {
      "title": "Know Your Rights: Demonstrations and Protests",
      "text": "The First Amendment protects your right to assemble and express your views through protest. However, police and other government officials are allowed to place certain narrow restrictions on the exercise of speech rights. Make sure you're prepared by brushing up on your rights before heading out into the streets."
    },
    "sections": [
      {
        "title": "I'm organizing a protest",
        "subsections": [
          {
            "title": "Your rights",
            "items": [
              "Your rights are strongest in what are known as \"traditional public forums,\" such as streets, sidewalks, and parks. You also likely have the right to speak out on other public property, like plazas in front of government buildings, as long as you are not blocking access to the government building or interfering with other purposes the property was designed for.",
              "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
              "Counterprotesters also have free speech rights. Police must treat protesters and counterprotesters equally. Police are permitted to keep antagonistic groups separated but should allow them to be within sight and sound of one another.",
              "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. On private property, the owner may set rules related to photography or video."
            ]
          },
          {
            "title": "Do I need a permit?",
            "items": [
              "You don't need a permit to march in the streets or on sidewalks, as long as marchers don't obstruct car or pedestrian traffic. If you don't have a permit, police officers can ask you to move to the side of a street or sidewalk to let others pass or for safety reasons.",
              "Certain types of events may require permits. These include a march or parade that requires blocking traffic or street closure; a large rally requiring the use of sound amplifying devices; or a rally over a certain size at most parks or plazas.",
              "While certain permit procedures require submitting an application well in advance of the planned event, police can't use those procedures to prevent a protest in response to breaking news events.",
              "Restrictions on the route of a march or sound equipment might violate the First Amendment if they are unnecessary for traffic control or public safety, or if they interfere significantly with effective communication to the intended audience.",
              "A permit cannot be denied because the event is controversial or will express unpopular views.",
              "If the permit regulations that apply to your protest require a fee for a permit, they should allow a waiver for those who cannot afford the charge."
            ]
          },
          {
            "title": "What to do if you believe your rights have been violated",
            "items": [
              "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
              "Get contact information for witnesses.",
              "Take photographs of any injuries.",
              "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
            ]
          }
        ]
      },
      {
        "title": "I'm attending a protest",
        "subsections": [
          {
            "title": "Your rights",
            "items": [
              "Your rights are strongest in what are known as \"traditional public forums,\" such as streets, sidewalks, and parks. You also likely have the right to speak out on other public property, like plazas in front of government buildings, as long as you are not blocking access to the government building or interfering with other purposes the property was designed for.",
              "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
              "Counterprotesters also have free speech rights. Police must treat protesters and counterprotesters equally. Police are permitted to keep antagonistic groups separated but should allow them to be within sight and sound of one another.",
              "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. On private property, the owner may set rules related to photography or video.",
              "You don't need a permit to march in the streets or on sidewalks, as long as marchers don't obstruct car or pedestrian traffic. If you don't have a permit, police officers can ask you to move to the side of a street or sidewalk to let others pass or for safety reasons."
            ]
          },
          {
            "title": "What happens if the police issues an order to disperse the protest?",
            "items": [
              "Shutting down a protest through a dispersal order must be law enforcement's last resort. Police may not break up a gathering unless there is a clear and present danger of riot, disorder, interference with traffic, or other immediate threat to public safety.",
              "If officers issue a dispersal order, they must provide a reasonable opportunity to comply, including sufficient time and a clear, unobstructed exit path.",
              "Individuals must receive clear and detailed notice of a dispersal order, including how much time they have to disperse, the consequences of failing to disperse, and what clear exit route they can follow, before they may be arrested or charged with any crime."
            ]
          },
          {
            "title": "If you are stopped by police while protesting",
            "items": [
              "Stay calm. Make sure to keep your hands visible. Don't argue, resist, or obstruct the police, even if you believe they are violating your rights. Point out that you are not disrupting anyone else's activity and that the First Amendment protects your actions.",
              "Ask if you are free to leave. If the officer says yes, calmly walk away.",
              "If you are under arrest, you have a right to ask why. Otherwise, say you wish to remain silent and ask for a lawyer immediately. Don't say anything or sign anything without a lawyer.",
              "You never have to consent to a search of yourself or your belongings. If you do explicitly consent, it can affect you later in court.",
              "Police may \"pat down\" your clothing if they suspect you have a weapon and may search you after an arrest."
            ]
          },
          {
            "title": "What to do if you believe your rights have been violated",
            "items": [
              "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
              "Get contact information for witnesses.",
              "Take photographs of any injuries.",
              "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
            ]
          }
        ]
      },
      {
        "title": "I was arrested at a protest",
        "subsections": [
          {
            "title": "Your rights",
            "items": [
              "If you are under arrest, you have a right to ask why. Otherwise, say you wish to remain silent and ask for a lawyer immediately. Don't say anything or sign anything without a lawyer.",
              "You have the right to make a local phone call, and if you're calling your lawyer, police are not allowed to listen.",
              "Police may \"pat down\" your clothing if they suspect you have a weapon and may search you after an arrest.",
              "You never have to consent to a search of yourself or your belongings. If you do explicitly consent, it can affect you later in court."
            ]
          },
          {
            "title": "The consequences of being arrested or convicted",
            "items": [
              "If you are released on bail, you must appear at your next hearing. Failure to do so could result in fines or incarceration.",
              "If you plead guilty to or are convicted of a crime, it will go on your criminal record.",
              "Arrests and convictions, even for misdemeanors, may affect your future. For example, you may need to disclose arrests or convictions on a bar application to become a lawyer or to obtain a security clearance for government or military jobs.",
              "Convictions may also limit your ability to bring legal claims for the deprivation of your constitutional rights."
            ]
          },
          {
            "title": "What to do if you believe your rights have been violated",
            "items": [
              "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
              "Get contact information for witnesses.",
              "Take photographs of any injuries.",
              "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
            ]
          }
        ]
      }
    ]
  }
