{
  "sources": "https://www.aclu-md.org/en/know-your-rights/know-your-rights-protesting",
  "intro": {
    "title": "Your Rights While Protesting",
    "text": "Get information on your rights while protesting, when you encounter police at protests, and if you are not a U.S. citizen. Also find out where you can protest and where you need a permit."
  },
  "sections": [
    {
      "title": "Protesting",
      "subsections": [
        {
          "title": "Your Rights",
          "items": [
            "You have the right to peacefully express your opinion, even if it is controversial.",
            "You have the right to protest in public spaces without blocking pedestrian or vehicle traffic without a permit. Larger demonstrations that block pedestrian or vehicle traffic may require a permit. But permit rules also have to allow for spontaneous demonstrations, or demonstrations meant to quickly respond to recent events. Permit rules that don't allow for this are unconstitutional.",
            "You have the right to take pictures and video of anything that is in plain view, including police officers. On private property, the owner may have different rules about taking pictures or videos. Officers can order you to stop any actions that are truly interfering with their activities, including taking pictures or videotaping. But moving further away should resolve concerns about interference.",
            "You have the right to hand out written materials and ask for donations on public sidewalks and parks without a permit. You might need a permit to set up a table."
          ]
        },
        {
          "title": "More Information",
          "items": [
            "If you violate the law as part of your protest activity, you can be subject to criminal punishment unless the law itself is found to be unconstitutional.",
            "Civil disobedience is not protected under the First Amendment because it involves violating the law in order to make a statement.",
            "Speakers cannot be arrested or punished simply for inflammatory speech. But they can be arrested for specifically advocating particular illegal actions if those illegal actions are likely to occur soon after the call to action.",
            "You have a right to counter-protest to express your opposition to someone else's demonstration, protest, or statements. However, police have the right, and obligation, to keep counter-protesters physically separate from those they are protesting, to protect both groups.",
            "If picketing, you are not required to move from public sidewalks, but you must make room for others to pass by. If you have a permit for your demonstration on that sidewalk, then you don't need to make room. In Maryland, picketing in residential areas can be considered disturbing the peace depending on the time of day and volume. Some jurisdictions have laws that prohibit targeted residential picketing, so you may need to march back and forth to stay within the law.",
            "Officers are not allowed to arrest you or deny a permit for the content of your speech.",
            "If a lawful order to disperse is given by police and you don't comply, you may be arrested even if you are not doing anything else illegal.",
            "Plan ahead for support in case you are arrested (attorneys, family needs, organizations to help with bail bonds, etc.)."
          ]
        }
      ]
    },
    {
      "title": "Police at Protests",
      "subsections": [
        {
          "title": "Your Rights",
          "items": [
            "You have the right to remain silent if an officer asks you questions. Say, \"I cannot talk to you without my lawyer.\"",
            "You have the right to leave if you are not being detained. Ask, \"Am I being detained, or am I free to go?\" If you are being lawfully detained, you do not have the right to leave, and if you attempt to leave an officer might arrest you.",
            "You have the right to say no if an officer asks for permission to search you. Say, \"I do not consent to searches.\"  This may not stop the officer from searching you, as some police searches do not require consent. Do not touch the officer, argue, or resist, but repeat that you do not consent to the search."
          ]
        },
        {
          "title": "More Information",
          "items": [
            "Anything you say or do can be used against you. Arguing, resisting, obstructing, or fighting may give police an excuse to arrest you.",
            "Stay calm, keep your hands visible, and point out that your activity is protected by the First Amendment.",
            "Plan ahead for support in case of arrest (attorneys, family needs, organizations to help with bail bonds, etc.).",
            "If you are under 18, immediately inform the officers that you are a minor because minors cannot be legally detained in adult facilities.",
            "Across most of Maryland, you don't need to show your ID to the police unless they are writing you a citation. In that situation, you can be arrested instead of receiving a criminal citation if they can't verify your identity.",
            "Officers cannot confiscate, delete, or demand to view your photographs or videos without a warrant. It is best to turn off all facial or fingerprint unlocking options (so that your phone cannot be easily unlocked without your consent). And never consent to giving officers your passcode.",
            "The police may pat down your clothing if they reasonably suspect that you have committed or are committing a crime, or if they reasonably suspect that you are concealing a weapon. Avoid resisting or touching the officer, but make it clear that you don't consent to any searches.",
            "Officers can attend protests undercover and they can legally pretend to be another protester.",
            "If you are confronted by officers, and want to leave, you can ask, \"Am I being detained or am I free to go?\" If you're free to go, you can walk away. If you are being detained, remain silent and ask if you are under arrest. If so, say, \"I cannot speak to you without my lawyer\"."
          ]
        },
        {
          "title": "Violations of Your Rights to Free Speech by Police or Police Misconduct at Protests",
          "items": [
            "Write down everything you remember: name, date and time, badge number, police department, witnesses, and details about what happened before, during, and after.",
            "Get contact information for witnesses.",
            "Document and photograph any injuries or damage.",
            "Call a lawyer, the ACLU, or file a complaint with the internal affairs division of the police department, or with a local civilian review board, if one exists."
          ]
        }
      ]
    },
    {
      "title": "Non-Citizens at Protests",
      "subsections": [
        {
          "title": "Your Rights",
          "items": [
            "Every person in the U.S. has the right to free speech, regardless of immigration status.",
            "You have the right not to answer any questions posed by police, including about your immigration status.",
            "You have the right to say no if an officer asks to search you. Say, \"I do not consent to searches.\"  This may not stop the officer from searching you, as some police searches do not require consent. Do not touch the officer, argue, or resist, but repeat that you do not consent to the search."
          ]
        },
        {
          "title": "More Information",
          "items": [
            "If you violate the law as part of your protest activity, you can be subject to criminal punishment unless the law itself is unconstitutional.",
            "Designate someone in advance to call if you are detained, share their number with someone in your group, and tell them where you are going.",
            "Plan ahead for support in case of arrest (attorneys, organizations to help with bail bonds, family needs, immigration, etc.).",
            "Turn off all facial or fingerprint unlocking options on your phone and make sure someone records information about the officer who arrests you.",
            "Avoid carrying your passport or any false documents while protesting. If you are a Green Card holder, you must carry your Green Card with you at all times. If you do not have a Green Card, but have other forms of ID, you may bring those forms of identification as well, including an Employment Authorization Document (EAD) card, a school ID, or a state ID.",
            "Avoid violating any laws, including acts of civil disobedience. Non-citizens are at risk of immigration consequences, in addition to the criminal consequences (including deportation)."
          ]
        }
      ]
    },
    {
      "title": "Where You Can Protest & Where You Need a Permit",
      "subsections": [
        {
          "title": "Permit Information",
          "items": [
            "Other outdoor publicly owned spaces may also be available as protest sites, but you cannot block access to buildings or interfere with other purposes the property is used for. Permits may be required, depending on the size and nature of the property.",
            "Your permit cannot be denied because of the controversial nature or unpopular viewpoint of your event.",
            "Permit rules must allow for protests that are in response to recent events, despite advance notice deadlines. If fees are required, there must be exceptions available for persons or groups who can't afford them. Permits cannot require proof of insurance, or compensation for loss or damages caused by others.",
            "Private property owners set the rules for speech on their own property. The government cannot restrict speech there if consent is given by the owner, though they can regulate noise levels and timing."
          ]
        },
        {
          "title": "About Permits",
          "items": [
            "Not all permit requirements are lawful. There are limits to when permits can be required (mostly to regulate competing uses of public space). There are limits on how permits can be structured (have to be content and viewpoint neutral, can't be used to block spontaneous speech, etc.). And there are limits on permit and event fees (can't vary with the message, or how controversial, etc., and need an exception for people who can't afford it)."
          ]
        },
        {
          "title": "Permit Difficulties",
          "items": [
            "Governments can regulate the time, place, and manner in which free speech rights are exercised, subject to the First Amendment. The regulations cannot be based on the content or the viewpoint of the speech. They must be narrowly tailored to serve a significant governmental interest. And they must leave open ample ways for the speaker to deliver their message. Regulations can take many forms, such as the route of the march, limits on noise levels, or restricting the time when protests may occur. However, excessive conditions/restrictions can be considered First Amendment violations, especially if they interfere significantly with effective communication with the intended audience.",
            "If you experience pushback, it is helpful if you can demonstrate other similar events that have been permitted in the past."
          ]
        }
      ]
    },
    {
      "title": "Free Speech, Civil Disobedience, and the First Amendment",
      "subsections": [
        {
          "title": "Definitions",
          "items": [
            "The First Amendment includes the freedom of speech, freedom of the press, the right to assemble, the right to religious liberty, and the right to petition the government for a redress of grievances.",
            "Freedom of speech is the right to express any opinion without censorship, restraint, or punishment, even if your opinion is controversial. Expressions of speech include a wide range of communications and actions, including some types of protest.",
            "Protesting is an action or statement expressing disapproval of something, including marches, picketing, rallies, and more.",
            "Civil disobedience is the intentional violation of laws or refusal to comply with laws as a peaceful form of political protest. Civil disobedience is not protected by the First Amendment and can result in criminal punishment.",
            "\"Protected speech\" vs. \"unprotected speech\":  Not all expressive conduct is automatically protected by the First Amendment. Governments can require permits for people to engage in expressive activities when it is necessary to manage competing uses of public spaces."
          ]
        },
        {
          "title": "Examples of \"protected speech\"",
          "items": [
            "Protesting in public spaces (with a permit, if required)",
            "Yard signs",
            "Holding banners and signs",
            "Statement-making acts: flag burning, wearing armbands, silent protest, etc."
          ]
        },
        {
          "title": "Examples of \"unprotected speech\"",
          "items": [
            "Sit-ins in buildings, blocking entrances to buildings, etc.",
            "Specifically advocating particular illegal actions if those illegal actions are likely to happen soon after the call to action",
            "Trespassing (protesting on private property without permission)",
            "Civil disobedience or other violation of law as a form of protest"
          ]
        }
      ]
    },
    {
      "title": "HOW TO AVOID POLICE SURVEILLANCE",
      "subsections": [
        {
          "title": "Protect Your Personal Privacy",
          "items": [
            "Switch your phone to airplane mode.",
            "Turn off location services in your apps, Bluetooth, and WiFi on your phone when not in use.",
            "Use a VPN when using public WiFi.",
            "Use encrypted messaging apps such as the Signal or Telegram for calls and texts.",
            "Masks and sunglasses can confuse facial recognition software.",
            "Leave your car at home to avoid license plate readers."
          ]
        },
        {
          "title": "Protect Your Photos, Videos, and People",
          "items": [
            "Be conscious of streaming, posting photos, or sharing what you are doing.",
            "Consider recording videos to your device rather than livestreaming. Livestreaming provides information to law enforcement, who may monitor your stream.",
            "Blur identifiers before posting photos and videos.",
            "Scrub metadata from your photos.",
            "How to avoid police surveillance - protect your photos, videos, and people."
          ]
        },
        {
          "title": "Protect Your Phone From Police Searches",
          "items": [
            "Do not unlock your phone or consent to a search.",
            "Police need a warrant to search your phone.",
            "Police also cannot force you to delete photos or videos under any circumstance.",
            "Turn off face and fingerprint recognition."
          ]
        }
      ]
    }
  ]
}
