{
  "sources": "https://www.aclufl.org/en/know-your-rights/demonstrations-and-protests",
  "intro": {
    "title": "Demonstrations and Protests",
    "text": "The right to join with fellow citizens in protest or peaceful assembly is critical to a functioning democracy. But it is also unfortunately true that governments and police have violated this right—by using mass arrests, illegal force, the criminalization of protest, and other means intended to thwart the right to free public expression, assembly, and association."
  },
  "sections": [
    {
      "title": "General guidelines",
      "subsections": [
        {
          "title": "Can my free speech be restricted because of what I say—even if it is controversial?",
          "items": [
            "No. The First Amendment generally prohibits restrictions based on the content of speech. However, this does not mean that the Constitution completely protects all types of speech in every circumstance. For example, threatening someone with violence is not protected. Additionally, government officials are allowed to place certain reasonable, nondiscriminatory, and narrowly drawn \"time, place, and manner\" restrictions on the exercise of First Amendment rights. This means police and other government officials can reasonably restrict where, when, and how certain speech is expressed, for example, requiring a permit for a parade that requires blocking traffic or street closures. But any such restrictions must apply to all speech regardless of its content or speaker."
          ]
        },
        {
          "title": "Where can I engage in free speech activity?",
          "items": [
            "Generally, most types of communicative expression are constitutionally protected (subject to reasonable restrictions) in \"traditional public forums,\" such as streets, sidewalks, and parks. Additionally, your speech or expression may be permitted at other public locations that the government has opened up to similar speech and expression, such as the plazas in front of government buildings. Under the new law, local governments can still issue permits to allow protests and demonstrations that block traffic. If a permit has not been issued, anyone standing in a street blocking traffic commits a civil violation and can be issued a ticket for $15. Critically, under the new law, if law enforcement deems the gathering a \"riot,\" anyone blocking traffic by \"force or threat of force\" can be charged with the new felony \"aggravated riot,\" which carries a penalty of up to 15 years in prison."
          ]
        },
        {
          "title": "What about free speech activity on private property?",
          "items": [
            "Generally, the owners of private property may set rules limiting your free speech. If you disobey the property owner's rules, they can order you off their property, and you may be arrested for trespassing if you do not comply."
          ]
        },
        {
          "title": "Does the anti-protest law protect me if I get injured?",
          "items": [
            "No. If you are hurt or your personal belongings are damaged, it's possible that you may not be able to recover damages under the new law."
          ]
        }
      ]
    },
    {
      "title": "Permits and specific activities",
      "subsections": [
        {
          "title": "Do I need a permit before I engage in free speech and assembly activity?",
          "items": [
            "Not usually. However, certain types of events require permits. Generally, these events are:",
            "A march or parade that does not stay on the sidewalk, and other events that require blocking traffic or street closure",
            "A large rally requiring the use of sound amplifying devices; or",
            "A rally at certain designated parks or plazas"
          ]
        },
        {
          "title": "Permit regulations and restrictions",
          "items": [
            "Many permit procedures require that the application be filed several weeks in advance of the event; however, the First Amendment prohibits such advance-notice requirements from being used to prevent rallies or demonstrations that are rapid responses to unforeseeable and recent events. Also, many permit ordinances give a lot of discretion to the police or city officials to impose conditions on the event, such as the route of a march or the sound levels of amplification equipment. Such restrictions may violate the First Amendment if they are unnecessary for traffic control or public safety, or if they interfere significantly with effective communication with the speaker or demonstrator's intended audience. A permit cannot be denied because the event is controversial or will express unpopular views."
          ]
        }
      ]
    },
    {
      "title": "Specific problems",
      "subsections": [
        {
          "title": "If organizers have not obtained a permit, where can a march take place?",
          "items": [
            "If marchers stay on the sidewalks and obey traffic and pedestrian signals, their activity is constitutionally protected even without a permit. Marchers may be required to allow enough space on the sidewalk for normal pedestrian traffic and cannot maliciously obstruct or detain passers-by."
          ]
        },
        {
          "title": "May I distribute leaflets and other literature on public sidewalks?",
          "items": [
            "Yes. You may approach pedestrians on public sidewalks with leaflets, newspapers, petitions, and solicitations for donations without a permit. You may also be able to set up a table on a sidewalk for these purposes if there is sufficient room for pedestrians to pass. These types of free speech activities are legal as long as entrances to buildings are not blocked and passers-by are not physically and maliciously detained. However, a permit may be required to set up a table or post signs. To avoid penalties for littering, make sure to properly dispose of any excess leaflets or other materials."
          ]
        },
        {
          "title": "Do I have a right to picket on public sidewalks?",
          "items": [
            "Yes, and this is also an activity for which a permit is not required. However, picketing must be done in an orderly, non-disruptive fashion so that pedestrians can pass by and entrances to buildings are not blocked."
          ]
        },
        {
          "title": "Can government impose a financial charge on exercising free speech rights?",
          "items": [
            "Some local governments have required a fee as a condition of exercising free speech rights, such as application fees, security deposits for clean-up, or charges to cover overtime police costs. Charges that cover actual administrative costs have been permitted by some courts. However, if the costs are greater because an event is controversial (or a hostile crowd is expected)—such as requiring a large insurance policy—then the courts will not permit it. Also, regulations with financial requirements should include a waiver for groups that cannot afford the charge so that even grassroots organizations can exercise their free speech rights. Therefore, an organization with limited resources should not be prevented from engaging in a march simply because it cannot afford a prosecutor's charges."
          ]
        }
      ]
    }
  ]
}
