{
  "sources": "https://www.acludc.org/en/know-your-rights/know-your-rights-demonstrations-dc",
  "intro": {
    "title": "Demonstrations in D.C.",
    "text": "The First Amendment to the U.S. Constitution protects \"the freedom of speech\" as well as \"the right of the people peaceably to assemble.\" That means you have a constitutional right to demonstrate. Police in D.C. generally understand that right. The great majority of demonstrations in D.C. are peaceful and most demonstrators do not encounter problems. Still, it pays to be prepared, especially if you plan to risk arrest."
  },
  "sections": [
    {
      "title": "Plan Ahead",
      "subsections": [
        {
          "title": "Know the Territory",
          "items": [
            "DC has four quadrants: NW, NE, SE, and SW. They meet at the Capitol. Most monuments and federal buildings are on and around the National Mall, which divides NW from SW. If you see an address, pay attention to the quadrant!"
          ]
        },
        {
          "title": "Getting a Permit or an Approved Plan",
          "items": [
            "Getting a permit is a good idea, to alert police what you'll be doing and reserve your location. Rules and procedures vary based on location.",
            "For details, visit: acludc.org/permits"
          ]
        },
        {
          "title": "Prepare to Encounter Law Enforcement",
          "items": [
            "Risking arrest? Carry $100 cash and 3 days' worth of any essential medication, in its original bottle. Make emergency childcare plans if you have young children. Put a password on your phone to protect against searches. Memorize (or write on your arm) numbers for your family, your lawyer, and jail support (i.e., community volunteers who help people navigate the legal system after an arrest).",
            "Not a U.S. citizen? Know your immigration number (\"A\" number) if you have one. Talk to a lawyer about the risks of arrest before participating, especially if you are undocumented.",
            "Undocumented, under court supervision, or have a record? Think hard and talk to a lawyer about the risks of arrest. The consequences can be worse for you than most people.",
            "A person with a disability, special medical needs, or limited English? Carry a card or wear a bracelet to explain your situation, should the need arise.",
            "Gender non-conforming? MPD, U.S. Park Police, and U.S. Capitol Police all respect gender designations on driver's licenses (we do not have information about other law enforcement agencies), so have an accurate license if possible."
          ]
        }
      ]
    },
    {
      "title": "Law Enforcement: Dos & Don'ts",
      "content": [
        "When interacting with police, it's important to stay calm and try to de-escalate the situation. For instance, you can respond to an officer's statements with generic, polite responses (Officer: What are you doing? Civilian: I'm attending a demonstration). If you start to feel uncomfortable, use the tips below to politely end the interaction or, if the officer detains you, protect your rights as long as the interaction continues."
      ],
      "subsections": [
        {
          "title": "When an officer approaches",
          "items": [
            "Do respond to the officer calmly and politely, without providing any detailed information about you, the people with you, or your activities.",
            "Do keep your hands in plain view.",
            "Do feel free to videotape officers; it's legal as long as you're not so close to them as to be interfering.",
            "Don't make sudden movements or point at the officer.",
            "Don't touch the officers or their equipment.",
            "Don't yell or otherwise escalate the situation."
          ]
        },
        {
          "title": "When being questioned",
          "items": [
            "Do ask: \"Am I free to leave?\" if officers make you feel uncomfortable, either because they're asking questions or for another reason. This phrase will help you find out if it is permissible for you to end the interaction. If the officer says yes, calmly and silently walk away. If the officer says no, you've been stopped and have to stay where you are.",
            "Do ask (if not free to leave): \"Am I under arrest?\" If the officer says yes, ask: \"For what crime?\"",
            "Do say, \"I wish to remain silent\"—and repeat if questioning continues.",
            "Do be thoughtful about whether to present your ID. MPD officers generally cannot force you to show your ID (though they can in some instances, such as asking for a driver's license if you're stopped while driving). Federal law officials can require non-citizens to show proof of their lawful status. If you are a non-citizen, you should carry multiple documents demonstrating your status.",
            "Don't discuss your immigration status, country of origin, or show any immigration documents if you are not a citizen if you do not have proof of valid, unexpired lawful status.",
            "Don't provide detailed information to police, other than to provide your name and address if asked",
            "Don't reveal information just because the police have made a promise to you; they can and do lie during questioning.",
            "Don't lie to the police or provide fake documents."
          ]
        },
        {
          "title": "When being searched or patted down",
          "items": [
            "Do say, \"I do not consent to this search\" if the police try or ask to search you or your belongings. Saying you don't consent may not stop officers from searching you (indeed, sometimes police can search you even without your permission), but it will constrain their ability to do so legally.",
            "Don't physically resist a search; if you do, you can be charged with assault.",
            "Do try to memorize the officer's name and badge number if an officer searches you without your consent, or otherwise escalates the interaction."
          ]
        },
        {
          "title": "When being arrested",
          "items": [
            "Do say: \"I wish to remain silent. I want a lawyer.\"",
            "Do give your name and address if asked.",
            "Do know that police can lie to you (if, for instance, they promise you'll get out faster if you answer questions).",
            "Don't resist, even if you believe the arrest is unfair.",
            "Don't give explanations or excuses.",
            "Don't sign anything you do not understand, especially any papers stating that you understand and want to waive your rights."
          ]
        },
        {
          "title": "If you feel your rights have been violated",
          "items": [
            "Police misconduct can't be challenged on the street. When you get home, write down everything you remember, such as: badge and patrol car numbers, which agency the officers were from, and contact information for witnesses (if you could get them at the scene). Take photos of any injuries (and seek medical attention). Keep all official paperwork and receipts for medical treatment. Then file a written complaint with the agency's internal affairs division or the D.C. Office of Police Complaints. Contact an attorney for additional help. To learn more about seeking the ACLU-DC's help to respond to violations of your rights, visit acludc.org/help."
          ]
        }
      ]
    },
    {
      "title": "If You Are Arrested",
      "content": [
        "If you are arrested during a demonstration, you will go through several steps in the legal process. Understanding these steps and your rights during each phase is crucial for protecting yourself."
      ],
      "subsections": [
        {
          "title": "Arrest and Booking Process",
          "items": [
            "Booking may happen at the local MPD precinct, Park Police headquarters, or the Capitol Police headquarters. You will be fingerprinted, photographed, and thoroughly searched.",
            "You will be either: cited (given a court date) and released; or allowed to \"post and forfeit\" (pay to have case dropped; arrest will remain on record but no conviction) – the amount depends on the charge but the cost is usually $25-100 for demonstration-related offenses; or detained at the police station and later transferred to Central Cell Block, 300 Indiana Ave NW, until your court hearing, where you will appear in person (unless you formally request, and receive approval, to appear remotely).",
            "Signing papers: Read all papers fully – know the form's purpose and what you would be agreeing to if you signed. Ask for an interpreter if you need one. Don't sign anything you don't understand. Don't write, sign, or verbally give a confession. If you are given a \"waiver of rights\" card, check the box that says you will not answer questions without a lawyer.",
            "Phone calls: You can ask for one, and the police often allow one, but they may refuse. Be aware that calls to people other than your attorney may be recorded.",
            "Charging: Prosecutors decide, during business hours, either to charge you or \"no-paper\" the case (let you go).",
            "Pretrial services interview: If detained and held for an appearance in court, D.C. Pretrial Services Agency or Court Social Services will interview you. The interview is voluntary but not confidential. Do not talk about the incident and arrest, or any unlawful activity. If you are undocumented, do not answer questions about your immigration status or country of origin. The judge may use the interview to decide whether or not to release you.",
            "Presentment/Arraignment is when you learn the charges against you, and whether you'll be released pending your next court date. Presentment/Arraignment is not trial."
          ]
        },
        {
          "title": "Presentment/Arraignment (Court Appearance)",
          "items": [
            "A lawyer will be there to help you. You will be charged with a crime and may (depending on your income) be given a lawyer to help going forward.",
            "If you have immigration concerns, be sure to alert your lawyer in person or during a confidential phone call about those concerns.",
            "The judge decides whether to release you, and you will have a date set for your next hearing. If you are undocumented or deportable, it is possible that you will be transferred into Immigration and Customs Enforcement custody instead of being released.",
            "The government may seek an order that you stay away from where you were arrested—or even larger areas. If you want to return there to protest or for another reason, tell your lawyer why and ask your lawyer to object.",
            "You'll likely be presented/arraigned the same day if arrested early, otherwise likely the next day. Saturday arrestees generally must wait until Monday.",
            "Presentments/Arraignments for prosecution under D.C. law occur at Superior Court, 500 Indiana Ave NW, Courtroom C-10 starting at 1 pm. For juveniles, court begins at 11 am or after. No arraignments take place on Sundays. It is possible, but unlikely, that a person arrested after a protest will have presentment at the federal courthouse, located at 333 Constitution Avenue NW"
          ]
        }
      ]
    },
    {
      "title": "Hotline for Protestors and Counsel Seeking Legal Advice",
      "content": [
        "Public Defender Service for the District of Columbia, Protest Hotline: (202) 824-2463 (available M-F from 9am to 5pm free of charge). Hotline additionally assists CJA and pro bono attorneys with general legal questions to support their clients facing protest-related issues in DC. PDS may also have information about the time and location of someone's arraignment or presentment."
      ]
    },
    {
      "title": "Useful Government Numbers and Addresses",
      "content": [
        "Federal authorities won't tell you whether someone has been arrested."
      ],
      "subsections": [
        {
          "title": "Metropolitan Police Department (MPD)",
          "items": [
            "MPD Information: 441 4th St NW, 5th Floor, (202) 727-9099 (to obtain information about any general, non-emergency MPD matters)",
            "MPD Office of Communications: 441 4th St NW, 6th Floor, (202) 727-4383 (to obtain updated information on MPD activity, e.g., when and where arrests happen, who has been arrested)",
            "MPD Public Documents Section: 441 4th St NW, Rm 550 South, (202) 727-4357 (to request a police report copy)",
            "Central Cell Block: 300 Indiana Ave NW, (202) 727-4222 (to obtain information about whether an arrestee is being held overnight and when they will be transferred out; only DC-licensed attorneys can visit)"
          ]
        },
        {
          "title": "Park Police",
          "items": [
            "Park Police D-1: 1100 Ohio Dr SW, (202) 426-6710 (to obtain information about general, non-emergency Park Police matters in the Central District area, e.g., how to recover lost property in that region)",
            "Park Police D-5: 1901 Anacostia Dr SE, (202) 961-4981 (to obtain information about general, non-emergency Park Police matters in the Anacostia and SE DC areas, e.g., how to recover lost property in those regions)"
          ]
        },
        {
          "title": "Other Important Contacts",
          "items": [
            "Capitol Police: 119 D St NE, (202) 224-1677 (to obtain general, public information on Capitol Police matters and arrests)",
            "Pretrial Services: 633 Indiana Ave NW, Ste 1120, (202) 585-7030 ext. 2 (to obtain information about the time and room number of someone's arraignment)",
            "For court information and case dockets: visit the websites of D.C. Superior Court (dccourts.gov) and the U.S. District Court (dcd.uscourts.gov)",
            "For each DC police precinct’s number, visit: acludc.org/precincts"
          ]
        }
      ]
    },
    {
      "title": "Números y Direcciones Útiles del Gobierno",
      "content": [
        "Autoridades federales no le informarán si alguien está bajo arresto."
      ],
      "subsections": [
        {
          "title": "Departamento de Policía Metropolitana (MPD)",
          "items": [
            "Información sobre el MPD: 441 4th St NW, 5th Floor, (202) 727-9099 (para obtener información sobre cualquier asunto general y que no sea de emergencia relacionado con el MPD)",
            "Oficina de Comunicaciones del MPD: 441 4th St NW, 6th Floor, (202) 727-4383 (para obtener información actualizada sobre la actividad del MPD, por ejemplo, cuándo y dónde suceden los arrestos, quién ha sido arrestado)",
            "Sección de Documentos Públicos del MPD: 441 4th St NW, Rm 550 South, (202) 727-4357 (para solicitar copias de informes policiales)",
            "Pabellón de celdas central: 300 Indiana Ave NW, (202) 727-4222 (para obtener información acerca de si la persona arrestada estará detenida durante la noche y cuándo será transferida; únicamente los abogados autorizados por el D.C. pueden visitarla)"
          ]
        },
        {
          "title": "Policía de Parques",
          "items": [
            "Departamento 1 de la Policía de Parques: 1100 Ohio Dr SW, (202) 426-6710 (para obtener información sobre asuntos generales y que no sean de emergencia relacionados con la Policía de Parques en el área del Distrito Central, por ejemplo, cómo recuperar propiedades perdidas en esa región)",
            "Departamento 5 de la Policía de Parques: 1901 Anacostia Dr SE, (202) 961-4981 (para obtener información sobre asuntos generales y que no sean de emergencia relacionados con la Policía de Parques en las áreas de Anacostia y SE DC, por ejemplo, cómo recuperar propiedades perdidas en esa región)"
          ]
        },
        {
          "title": "Otros Contactos Importantes",
          "items": [
            "Policía del Capitolio: 119 D St NE, (202) 224-1677 (para obtener información pública general sobre asuntos y arrestos de la Policía del Capitolio)",
            "Agencia de Servicios Previos al Juicio: 633 Indiana Ave NW, Ste 1120, (202) 585-7030 ext. 2 (para obtener información sobre la hora y número de sala de la lectura de cargos de una persona)",
            "Para conocer el número de teléfono de cada comisaría de la policía de D.C., visite: acludc.org/precincts"
          ]
        }
      ]
    }
  ]
}
