{
  "sources": "https://www.aclu-ms.org/en/know-your-rights/protesters-rights",
  "intro": {
    "title": "Protesters' Rights",
    "text": "\"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or the press; or the right of people peaceably to assemble, and to petition the Government for redress of grievances.\" - First Amendment to the U.S. Constitution"
  },
  "sections": [
    {
      "title": "ACLU of Mississippi Protester Alert",
      "subsections": [
        {
          "title": "Protected Speech and Civil Disobedience",
          "items": [
            "It is important to differentiate between protesting with protected speech under the First Amendment to the U.S. Constitution and using civil disobedience. The First Amendment covers all forms of communication including music, theater, film and dance. The constitution also protects actions that symbolically express a viewpoint. Examples of these symbolic forms of speech include wearing masks and costumes or holding a candlelight vigil.",
            "However, symbolic acts and civil disobedience that involve illegal conduct may be outside the realm of constitutional protections and can sometimes lead to arrest and conviction. Therefore, while sitting in a road may be expressing a political opinion, the act of blocking traffic may lead to criminal punishment."
          ]
        }
      ]
    },
    {
      "title": "Your Rights as a Protester",
      "subsections": [
        {
          "title": "General Rights",
          "items": [
            "Generally, all types of expression are constitutionally protected in traditional \"public forums\" such as streets, sidewalks and parks. In addition, your speech activity may be permitted to take place at other public locations that the government has opened up to First Amendment activities, such as the plazas in front of government buildings.",
            "You have the right to distribute literature, chant, and engage passersby in debate, but you do not have the right to block sidewalks or building entrances or physically harass people.",
            "You do not have to consent to a search of yourself, your possessions or your car. If an officer asks your permission to search you, your possessions or your car you can exercise that right by saying, \"I do not consent to a search.\" Legally they cannot infer any wrong doing from your refusal.",
            "You can observe, photograph or record the police in the performance of their duties; however, you cannot interfere with a law enforcement officer in the performance of her/his duties. You are required to obey the lawful order of a police officer.",
            "Generally a permit is not required for a small group to protest in a traditional \"public forum.\""
          ]
        }
      ]
    },
    {
      "title": "Limitations on Speech",
      "subsections": [
        {
          "title": "",
          "items": [
            "The government can limit speech by imposing nondiscriminatory narrowly drawn \"time, place, and manner\" restrictions. This is most commonly done by requiring permits for meetings, rallies, and demonstrations.",
            "The First Amendment does not protect speech that incites violence, is obscene, or is threatening.",
            "What you say to the police is always important. What you say can be used against you, and it may give the police an excuse to arrest you.",
            "It is a federal crime to threaten to harm the President, the Vice President, or a major candidate for either office."
          ]
        }
      ]
    },
    {
      "title": "Limitations on Action",
      "subsections": [
        {
          "title": "",
          "items": [
            "If you endanger others through the manner in which you choose to protest, you can be arrested. For example, a protest that blocks traffic is illegal without a permit.",
            "You cannot block pedestrians from walking on a side walk or entering buildings.",
            "Protesting on private property is not protected by the law.",
            "Do not interfere with, touch or verbally antagonize the police.",
            "Avoid carrying any drugs or weapons. If you happen to be arrested you could face additional charges for their possession."
          ]
        }
      ]
    },
    {
      "title": "If You Are Arrested",
      "subsections": [
        {
          "title": "",
          "items": [
            "Do not run or resist. It may result in additional charges.",
            "You have a right to remain silent. You can exercise that right by stating clearly that you do not want to answer questions, you want to speak to a lawyer.",
            "If you feel your rights have been violated, write down everything you can remember, including officers' badge and patrol car numbers, which agency the officers were from, and any other details. Get contact information for witnesses.",
            "Contact a lawyer to get specific legal advice."
          ]
        }
      ]
    }
  ],
  "footer": {
    "text": "Protesters engaged in protected First Amendment activities who believe their rights have been violated are encouraged to report these concerns to the ACLU of Mississippi at 601-354-3408."
  }
}
