{
  "sources": "https://www.nyclu.org/resources/know-your-rights/know-your-rights-demonstrating-central-new-york",
  "intro": {
    "title": "Know Your Rights: Demonstrating in Central New York",
    "text": "IMPORTANT NOTE: These guidelines are only applicable to Central New York, and local guidelines should always be consulted.\n\nThe First Amendment guarantees people the right to express their opinions and protest in streets in their communities. This includes the right to distribute flyers or leaflets; the right to hold demonstrations, press conferences, or rallies, and the right to march on public sidewalks and in public streets. This also includes the right to express opinions on controversial topics. Each local government can impose certain restrictions on the time, location or manner of your activities. In some instances municipalities will require you to obtain a parade or rally permit before engaging in certain types of activity."
  },
  "sections": [
    {
      "title": "Do I Need a Permit to Hold a Demonstration, March or Rally or to Distribute Literature to the Public?",
      "content": [
        "It depends on what you want to do. If you as an individual or small group want to protest or distribute flyers, have a demonstration or rally on a public sidewalk, and do not intend to use amplified sound, you do not need any permit. You do not have to notify police or other local government authorities in advance.",
        "Local governments, however, may require you to seek a permit if your group is large, if you want to use sound amplification equipment, or if you want to march on a public street. Also, most municipalities will require a permit if you intend to amplify sound with more than just a standard bullhorn. If you want to hold an event in front of a public building, or in a public square, plaza, or park you may also need to seek a permit from the local authorities. You should call the city clerk or police department ahead of time to find out about the particular procedures in their municipality. Seek your permit well in advance."
      ]
    },
    {
      "title": "If I Want to Hold a Demonstration or Rally, or to Distribute Flyers on a Public Sidewalk, What Do I Need to Do?",
      "content": [
        "Nothing, but plan your event. If you want to, you can notify the police department, but that is not required. If you do notify the police, officers may appear at the event. If your event involves a large number of people, you may need to seek a permit beforehand. Without a permit, the police may stop your event if they perceive that your group is large enough to seem like \"a mob.\"",
        "You must allow pedestrians to use the sidewalk too, and you need to leave at least one-half of the sidewalk free and clear. You also cannot block building entrances, so avoid placing yourself in the way of people entering and exiting buildings and businesses."
      ]
    },
    {
      "title": "What if I Want to March on a Public Street?",
      "content": [
        "In legal terms, a demonstration becomes a \"parade\" when protestors move into the street; and a permit is usually required for a parade. In some municipalities you request a parade or rally permit from the local police, or from the city clerk or parks department. (see later info. on specific CNY cities). There should be no fee to apply for a parade or rally permit. As a general rule, police departments will only allow marches to take place in the street if the group has enough people so that it wouldn't be safe or otherwise reasonable for the group to march on the sidewalk. When a group is allowed to march in the street, the police will often provide an escort or block off a portion of the roadway for the group."
      ]
    },
    {
      "title": "What if I Want to Hold a Rally, Demonstration, or Distribute Flyers in a Public Park, Square, Plaza, or Near a Public Building?",
      "content": [
        "You are entitled to distribute flyers, or to have a rally, demonstration, or press conference in a public park, plaza, square or near a public building (i.e. not just on the sidewalk), but you may need to seek a parade or rally permit from local authorities. In some municipalities you request such a permit from the local police or from the city clerk or parks department. (See information on specific Central New York cities below.) You should call ahead of time to find out about the procedures in a particular municipality."
      ]
    },
    {
      "title": "What Else Do I Need to Know When Seeking a Permit?",
      "content": [
        "If you want to hold an event that may require a permit, apply for the permit as soon as possible. Do not wait until the last minute. The First Amendment requires that the permit procedures include a provision for waiving advance application deadlines in cases where free expression would be stifled if advance notice was required. The police or other local officials may ask you questions about your event. They are entitled to ask you questions about your event, but you do not have to answer every type of question. The local authorities may have a standard set of guidelines or rules for events at particular locations. You should request a copy of this when you seek a permit or notify local police about your event. A municipality should not impose more restrictions on one group than another based on the categories of people involved or the content of a social or political message. If this does occur, please contact the Central New York office of the NYCLU at (315) 471-2821 as soon as possible. You should be free to use banners or signs at your event, but the local police may place restrictions on the size or construction of signs and banners. In New York City, for instance, signs may not be affixed to wooden sticks, so demonstrators attach signs to cardboard tubing or hold them in their hands. You may not be allowed to affix signs or banners to public property, such as light posts or telephone poles without prior permission. If you are unsure if a particular guideline or restriction is reasonable, contact the Central New York office of the NYCLU."
      ]
    },
    {
      "title": "What should I keep in mind during a protest when interacting with the police?",
      "content": [
        "Do not block pedestrian traffic on a sidewalk; try to leave part of the sidewalk free and clear. Do not block the entrance or exit from a building or business; leave a clear space for access and egress. Do not block traffic when crossing the street, unless you have obtained a parade permit that allows you to do so as you march in the street. Have the permit with you. Your spokespersons should introduce themselves to police or public officials observing your event. If there is a question about the conduct of your protest, one or two people should be designated to discuss the situation or negotiate with police. Remain calm and be polite. Avoid engaging in an escalating argument with local officials in a group setting. A police officer may order you to move, leave, put down a sign, or stop an activity during a protest. Obey their instructions unless you have specifically planned to engage in peaceful civil disobedience. Any time you disobey the direct orders of a police officer you are risking arrest. The police customarily give you a warning before moving to arrest, but they do not have to warn you or give you ample time to comply. You should obey their instructions even if it seems like their action would violate your First Amendment rights. Comply first, and then contact the NYCLU about the matter later.",
        "Do not push, shove or crowd police officers, and do not attempt to interfere with the approaching or arresting someone else at the event. These actions can lead to immediate arrest. If the police move to arrest or get physical with a demonstrator, you can observe from a safe distance unless ordered to leave the area. Write down times, names, locations, witnesses and take notes about what occurs. You can also ask an officer for their name and badge number. Do not leave signs, papers, beverages, or trash at a protest site. Do not bring any kind of weapon. If you are responsible for your conduct, there will be less reason for authorities to resist your return to that location."
      ]
    },
    {
      "title": "When Planning a Demonstration in These Central New York Cities:",
      "subsections": [
        {
          "title": "Auburn",
          "items": [
            "For parade permit, send letter to City Manager 2 weeks in advance – can be approved right away. Describe who, what, when, where, why. More info call (315) 255-4146"
          ]
        },
        {
          "title": "Binghamton",
          "items": [
            "For permit for large assembly (21+) or parade, send letter to City Clerk's office 4 weeks in advance – describe who, what, when, where, why. More info call (607)772-7005"
          ]
        },
        {
          "title": "Ithaca",
          "items": [
            "Permit requests for large assemblies (50+) or parade, sound amplification, use of \"Commons\" and street closing available at www.cityofithaca.org. Submit request 2 weeks in advance – can be approved in 72 hours. More info call City Clerk (607)274-6570"
          ],
          "link": {
            "text": "www.cityofithaca.org",
            "url": "http://www.cityofithaca.org"
          }
        },
        {
          "title": "Oswego",
          "items": [
            "Send letter to Mayor's office in advance. Permit from Mayor or police chief required for parade. Describe who, what, when, where, why. More info call (315)342-8116"
          ]
        },
        {
          "title": "Rome",
          "items": [
            "For sidewalk protest, contact Police Dept at (315) 339-7780. For large groups, events, parade in street, contact Parks & Rec. Dept. for Special Events Permit (315) 339-7652. $25-100 application fee, insurance and escrow requirement may be waived/reduced upon request."
          ]
        },
        {
          "title": "Syracuse",
          "items": [
            "For parade/public assembly permit, contact Police Dept. Special Events Office 7-10 working days in advance at (315) 442-5203. For protest in public park or gathering of more than 100 people, contact Parks Dept. 2 weeks in advance for Event Permit at (315) 473-4330."
          ]
        },
        {
          "title": "Utica",
          "items": [
            "For parade permit, send letter to City Clerk's office 3-4 weeks in advance describe who, what, when, where, why. More info call City Clerk (315)792-0113"
          ]
        },
        {
          "title": "Watertown",
          "items": [
            "Send letter to City Clerk 3 weeks in advance – describe who, what, when, where, why. More info call (315)785-7780"
          ]
        }
      ]
    }
  ]
}
