{
  "sources": "https://www.aclupa.org/en/know-your-rights/know-your-rights-protest",
  "intro": {
    "title": "Know Your Rights: Demonstrations and Protests",
    "text": "The First Amendment protects your right to assemble and express your views through protest. But it is also unfortunately true that governments and police can violate this right – through the use of mass arrests, illegal use of force, criminalization of protest, and other means intended to thwart free public expression."
  },
  "sections": [
    {
      "title": "Are there limits on what I can say?",
      "content": [
        "Yes. The First Amendment broadly protects speech, including controversial viewpoints and criticism of virtually anything, including government officials, but there are limits. You can be arrested for encouraging \"imminent\" violence or other immediate illegal activities that threaten harm to people or property. You can also be arrested for threatening to harm another person."
      ]
    },
    {
      "title": "Is violence or property destruction ever constitutionally protected?",
      "content": [
        "No. Violence and property destruction are not protected by the First Amendment, even if you do it to express a political message."
      ]
    },
    {
      "title": "Where can I exercise my speech rights?",
      "content": [
        "On any private property where the owner gives permission (the owner always decides) and in any area open to the public, such as streets, sidewalks, town squares, or parks. If you plan to block passage on a street or sidewalk, you must apply for a permit."
      ]
    },
    {
      "title": "Should I get a permit?",
      "content": [
        "In general, permits offer more speech protection and organizers can usually apply for traffic safety control when they apply for a permit. Permits are especially useful when you want to protest in the street and/or when you expect young children may join your protest."
      ]
    },
    {
      "title": "Can I express myself in public places without a permit?",
      "content": [
        "Yes, you can picket or leaflet in public places by yourself or in small groups without a permit so long as you are not blocking streets, sidewalks, or entrances to buildings."
      ]
    },
    {
      "title": "Can I approach other people in public areas?",
      "content": [
        "Yes. You may approach pedestrians with leaflets, newspapers, petitions and requests for donations. But you cannot prevent people from getting by or walking away, and you should leave them alone if asked to do so. You cannot block building entrances or leave literature on private property (including car windows) without the owner's permission."
      ]
    },
    {
      "title": "Can I heckle other speakers?",
      "content": [
        "Generally, yes, unless the speaker has a permit to use a public space, in which case hecklers may be required to stand outside that area. Police may keep two opposing groups separated but should allow them to be within the same general area."
      ]
    },
    {
      "title": "What should I do if I am ordered to disperse?",
      "content": [
        "A police officer can order a \"disorderly\" group to leave an area, even in a place where they have a right to be, if the officer reasonably expects the group's presence will result in substantial harm or serious inconvenience, annoyance, or alarm. If you hear an officer give an order to disperse, you will be arrested if you do not obey."
      ]
    },
    {
      "title": "What is civil disobedience?",
      "content": [
        "Civil disobedience is peaceful but unlawful activity as a form of protest–for instance, \"occupying\" private property. It can be (and often is) prosecuted. You should expect to be arrested."
      ]
    },
    {
      "title": "Interactions with Law Enforcement",
      "subsections": [
        {
          "title": "Can I record or photograph police in public?",
          "items": [
            "Yes. Pennsylvania law forbids audio recordings of what people say without their permission if they have a reasonable expectation of privacy, but that does not apply to police who are performing official duties in public."
          ]
        },
        {
          "title": "Can undercover police monitor protest activities?",
          "items": [
            "Generally, yes, police may monitor protesters' internet postings, attend public protests, record or photograph demonstrators, or attend planning meetings to learn about planned protest activities."
          ]
        },
        {
          "title": "Do I have to show ID when police demand it?",
          "items": [
            "Not in Pennsylvania. If you are detained or arrested, you may choose to show ID when police demand it. If you choose not to show ID, you could be detained for a longer time while police attempt to identify you."
          ]
        },
        {
          "title": "Can police search demonstrators?",
          "items": [
            "If police have reasonable suspicion that you are involved in or about to commit criminal activity, they can stop you. Additionally, if police have reasonable suspicion that you are armed, they can also frisk or \"pat down\" your outer clothing to search for weapons. But things are a bit different in Philadelphia. Because of a lawsuit, Bailey v. City of Philadelphia, officers must warn someone to stop doing unlawful activity before they stop or frisk them if that activity is one of several low-level offenses, but those offenses do not include things protesters are usually charged with (e.g., failure to disperse)."
          ]
        },
        {
          "title": "Can police search bags and containers without probable cause?",
          "items": [
            "Yes, if you are entering what has been marked a secure area. But you can choose to refuse the search and not enter the secure area. Otherwise, police can only search bags if they have probable cause that it contains contraband, weapons, or evidence of illegal activity."
          ]
        }
      ]
    },
    {
      "title": "If You Are Stopped or Questioned by Police",
      "content": [
        "Determine if you are being detained by asking the officer if you are free to leave. If the answer is yes, calmly walk away.",
        "Stay calm and in control of your words, body language, and emotions.",
        "If police ask to frisk and \"pat down\" your outer clothing, tell them you do not consent, but do not physically resist. Also, say clearly that you do not consent to further search. Police officers may not confiscate or demand to view your photographs or video without a warrant. Police may not delete data from your device under any circumstances.",
        "The First Amendment allows you to criticize or swear at the police, but insulting or arguing with the police may get you arrested.",
        "You may tell police officers that you wish to remain silent. If you do talk to the police, do not lie. This is a crime. Remember, anything you say or do can be used against you.",
        "Keep your hands where police can see them and don't make any sudden moves."
      ]
    },
    {
      "title": "If you believe your rights have been violated",
      "content": [
        "Remember officers' badge or patrol car numbers.",
        "Write down everything you remember ASAP.",
        "Try to find witnesses and get their names and phone numbers.",
        "If you are injured, take photos of the injuries ASAP, but don't delay seeking medical attention.",
        "Even if you think the police are doing something wrong or illegal, do not argue with them or physically struggle. You won't win, and the charges against you are likely to be more severe. Police misconduct should be addressed only after the fact."
      ]
    },
    {
      "title": "If You Are Arrested or Taken to a Police Station",
      "content": [
        "Ask for a lawyer immediately if you are arrested. If you can't afford a lawyer, you are entitled to a free, court-appointed lawyer before you are questioned.",
        "You have the right to remain silent. You may simply say, \"I am going to remain silent and would like a lawyer.\"",
        "Do not discuss your case over the phone; calls from police stations and jails are monitored or recorded.",
        "Do not discuss your case with others being held; they may be undercover police.",
        "Do not make any decisions in your case until you have spoken with a lawyer.",
        "A judge will decide if the charges against you are supported by probable cause, and if so, the judge may set bail. Bail may be denied if you don't have ID."
      ]
    },
    {
      "title": "Things to Keep in Mind",
      "content": [
        "Carry ID. Never carry false ID.",
        "You should make arrangements in advance with friends about what to do if one of you is arrested."
      ]
    }
  ]
}
