{
  "sources": "https://www.acluwv.org/en/election-and-right-protest",
  "intro": {
    "title": "The Election and the Right to Protest",
    "text": "Even amid a global pandemic 2020 has been a big year for the right to protest. People have come out in force to protest police brutality and killings, particularly against Black Americans. Protest is a fundamental American right enshrined in the First Amendment. But even a right as basic as this can't be taken for granted."
  },
  "sections": [
    {
      "title": "The State of Protest Rights in West Virginia",
      "content": [
        "Despite the lip-service paid to the First Amendment, protest has often been met with heavy-handed state-backed violence. In recent years, there have been numerous legislative efforts to limit this right. Numerous states have considered bills to indemnify people who harm protestors. Police have been given additional surveillance powers. Earlier this year West Virginia joined a number of other states in passing a law that increases penalties for civil disobedience.",
        "The West Virginia Critical Infrastructure Protection Act (HB 4615) enhances criminal penalties for trespass on certain properties, deemed to be critical infrastructure. These laws became popular as a response to protests against pipeline construction through indigenous lands, environmental preserves, and private property. Civil disobedience is not protected by the First Amendment but has a long history of being an effective part of protest and social change. The law also allows conspiracy charges against individuals and organizations that part of any plan to trespass. This guilt by association is a direct assault on First Amendment protections of the Freedom of Association.",
        "Elections don't just matter for who we choose to represent us. They can affect how we are able to express our opinions to our representatives. The right to assemble, freedom of association, and the right to protest will only be protected if we elect people committed to protecting these rights.",
        "Contextual Links:"
      ],
      "links": [
        {
          "text": "protest has often been met with heavy-handed state-backed violence",
          "url": "https://www.acluwv.org/en/protest-has-often-been-met-heavy-handed-state-backed-violence"
        },
        {
          "text": "indemnify people who harm protestors",
          "url": "https://www.acluwv.org/en/indemnify-people-who-harm-protestors"
        },
        {
          "text": "given additional surveillance powers",
          "url": "https://www.acluwv.org/en/given-additional-surveillance-powers"
        },
        {
          "text": "The West Virginia Critical Infrastructure Protection Act (HB 4615)",
          "url": "https://www.acluwv.org/en/west-virginia-critical-infrastructure-protection-act-hb-4615"
        },
        {
          "text": "became popular",
          "url": "https://www.acluwv.org/en/became-popular"
        }
      ]
    }
  ]
}
