{
  "sources": "https://www.aclu-ia.org/en/protest",
  "intro": {
    "title": "Know Your Rights: Demonstrations and Protests in Iowa",
    "text": "The First Amendment protects your right to assemble and express your views through protest. However, police and other government officials are allowed to place certain narrow restrictions on the exercise of speech rights. Make sure you're prepared by brushing up on your rights before heading out into the streets."
  },
  "sections": [
    {
      "title": "Can my free speech be restricted because of what I say, even if it is controversial?",
      "subsections": [
        {
          "title": "",
          "items": [
            "No. Both the First Amendment of the U.S. Constitution and Article I, Section 7 of the Iowa Constitution prohibit restrictions based on the content of speech.",
            "However, this does not mean that the Constitution completely protects all types of speech activity in every circumstance. The government is allowed to place certain nondiscriminatory and narrowly drawn \"time, place and manner\" restrictions on the exercise of free speech and expression rights.",
            "But any \"time, place, or manner\" restrictions must apply to all speech regardless of its point of view. For instance, the government may validly impose permit requirements for large groups using parks or limits on the loudness of sound amplifiers.",
            "The government may also limit speech or activity that is overly disruptive, such as shouting in a quiet auditorium to interrupt a speaker, as long as officials have requested the protester to stop the disruptive behavior, and the restriction is not based on viewpoint. However, whether the behavior is disruptive depends on context. For example, shouting at an outdoor rally may be wholly appropriate.",
            "Finally, some speech is not protected, like \"true threats\" of violence or expression that a court determines is an \"obscenity.\""
          ]
        }
      ]
    },
    {
      "title": "Where can I engage in free speech?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Generally, all types of expression are constitutionally protected in traditional \"public forums\" such as streets, sidewalks, and parks. In addition, you may have a right to speak in other public locations that the government has opened up to unrestricted public speech, such as the plazas in front of government buildings or outdoor areas of public—not private—universities and colleges.",
            "There are different rules for different locations. Learn the rules for the location where you are planning to protest or demonstrate before your activity begins.",
            "Keep in mind that excessive noise or disruption, obstructions of sidewalks or doorways, or harassment of unwilling passers-by could be used by officials to end your activity. Observe traffic rules and other reasonable time, place, and manner restrictions. But you have a right to be heard, and officials shouldn't direct you to a route that doesn't reach your target audience."
          ]
        }
      ]
    },
    {
      "title": "What about speech on private property?",
      "subsections": [
        {
          "title": "",
          "items": [
            "The general rule is that the owners of private property may set rules limiting your free speech on that property. If you disobey the property owner's rules, they can order you off their property and have you arrested for trespassing if you do not comply. Your speech may not be restricted on your own property, or with the property owner's consent. Privately owned shopping malls are considered private property in Iowa, even though they are held open to the public."
          ]
        }
      ]
    },
    {
      "title": "Do counter-demonstrations have free speech rights too?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Yes. Even though counter-demonstrators should not be allowed to physically disrupt the event they are protesting, they do have the right to be present and to voice their disagreement.",
            "Police are permitted to keep two antagonistic groups separated but should allow them to be within the general vicinity of one another in order to communicate their messages safely."
          ]
        }
      ]
    },
    {
      "title": "If I am a minor, can I demonstrate at night?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Yes. Although minors may generally be prohibited from being out after a certain time, curfew laws must provide exceptions for fundamental rights such as marches."
          ]
        }
      ]
    },
    {
      "title": "Do I need a permit?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Not usually. However, certain types of events require permits. Generally, these events are:",
            "A march or parade that does not stay on the sidewalk or other locations traditionally used for speech, like some parks, town squares, areas around the State Capitol, and others.",
            "A large rally requiring sound-amplifying devices.",
            "Unless there are special circumstances, notice requirements of more than a few days are typically not constitutional. Additionally, any advance-notice requirement can't be used to prevent demonstrations that are rapid responses to unforeseeable and recent news events. Permit ordinances must allow for spontaneous demonstrations. That means, for example, that a permit may not be required when responding to breaking news, even where it would be required for a planned event.",
            "Also, many permit ordinances give a lot of discretion to the police or city officials to impose conditions on the event, such as the route of a march or the sound levels of amplification equipment. Such restrictions may violate the First Amendment if they are unnecessary for traffic control or public safety or if they interfere significantly with effective communication with the intended audience. A permit cannot be denied because the event is controversial or will express unpopular views."
          ]
        }
      ]
    },
    {
      "title": "Without a permit, where can a march take place?",
      "subsections": [
        {
          "title": "",
          "items": [
            "If marchers stay on the sidewalks and obey traffic and pedestrian signals, their activity is constitutionally protected even without a permit. Marchers may be required to allow enough space on the sidewalk for normal pedestrian traffic."
          ]
        }
      ]
    },
    {
      "title": "Do I have a right to picket on public sidewalks?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Yes, and this is also an activity for which a permit is not required. But picketing must be orderly and non-disruptive so pedestrians can pass by and entrances to buildings are not blocked. Additionally, cities may constitutionally prohibit picketing in residential areas."
          ]
        }
      ]
    },
    {
      "title": "What do I do if police stop me?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Stay as calm as you can and don't run. Don't resist, argue, or obstruct the police, even if you are innocent or you believe that the police are violating your rights.",
            "Make sure to keep your hands where police can see them.",
            "Ask if you are free to leave. If the officer says yes, be as calm and silent as you can and walk away.",
            "You have the right to remain silent and cannot be punished for refusing to answer an officer's questions. If you wish to remain silent, tell the officer that you wish to remain silent.",
            "In Iowa, there is no law requiring you to give your name to police if asked to identify yourself during a stop, although police can ask you for your driver's license, registration, and insurance if you are the driver during a traffic stop. If you are a passenger in a car, you are not required to identify yourself.",
            "Do not give police a false or fictitious name.",
            "You do not have to consent to a search of yourself or your belongings. But police may 'pat down' your clothing if they suspect a weapon.",
            "You should not physically resist, but you have the right to refuse consent to any search. If you do consent, it can affect you later in court. Do not lie about your citizenship status or provide fake documents to the police.",
            "If you are arrested, say you want to remain silent and ask for a lawyer immediately. Then don't say anything, sign anything, or make any decisions without a lawyer."
          ]
        }
      ]
    },
    {
      "title": "What if I'm under arrest?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Do not resist arrest, even if you believe the arrest is unfair.",
            "Say you wish to remain silent and ask for a lawyer immediately.",
            "Don't give any explanations or excuses. Don't say anything, sign anything, or make any decisions without a lawyer.",
            "Even after you are arrested, if police ask for your consent to search your belongings, including your phone, you are not required to give consent, and giving consent could be used against you later.",
            "In Iowa, you have a right to call a lawyer, a member of your family, or both. Officers may not tell you about your right to call your attorney and family member, so you should affirmatively and clearly ask to make these calls. At the jail, the officers may ask you to sign a form that you have made all the calls you wish to make. Don't sign anything without a lawyer. When you make a call, the call usually occurs in the presence of police, so be careful what you say, even to an attorney. However, your attorney must be allowed to see and consult with you in private at the jail or other place where you are being held."
          ]
        }
      ]
    },
    {
      "title": "What do I do if my rights have been violated?",
      "subsections": [
        {
          "title": "",
          "items": [
            "The street is not the place to challenge police misconduct.",
            "Don't physically resist officers or threaten to file a complaint.",
            "As soon as you can, write down everything you remember, including officers' names, badge and patrol car numbers, which agency the officers were from, and any other details.",
            "Get contact information from witnesses.",
            "If you are injured, take photographs of your injuries (but seek medical attention first).",
            "Once you have this information, you can file a written complaint with the agency. In some cases, you can file a complaint anonymously. You can also seek the assistance of an attorney."
          ]
        }
      ]
    },
    {
      "title": "If I engage in civil disobedience, am I protected from arrest or other legal action?",
      "subsections": [
        {
          "title": "",
          "items": [
            "No. Civil disobedience is typically defined as peaceful, but intentionally unlawful, activities as a form of protest.",
            "Civil disobedience has played--and currently plays--an important role in many social justice and civil rights movements. But violations of the law can legally result in arrest and criminal prosecution that the First Amendment does not protect against.",
            "Before you engage in civil disobedience, you should find out what the consequences could be for you. You may be arrested and also charged with a crime. The consequences may be more harmful to some people than others, for example, based on immigration status or parole or probation status. If you have questions about how engaging in civil disobedience may impact you, you should talk with an attorney."
          ]
        }
      ]
    },
    {
      "title": "If police give orders to disperse, do I have to leave?",
      "subsections": [
        {
          "title": "",
          "items": [
            "No police officer should give an 'order to disperse' (leave) unless an unlawful assembly has been declared. This might happen at an otherwise peaceful protest where some people become violent or destroy property.",
            "But police do not always follow the law. Police may wrongly declare a gathering an unlawful assembly, or give an order to disperse that isn't proper. Regardless, if you hear an officer give an order to disperse and you do not obey, you will be subject to arrest, and potentially to harmful police crowd control tactics, like pepper spray."
          ]
        }
      ]
    },
    {
      "title": "If police give orders to disperse, how should I leave and how far away do I have to go? And what if they block my ability to leave the area?",
      "subsections": [
        {
          "title": "",
          "items": [
            "To be safe, you should try to leave the area of the protest as calmly and quickly as you can, and get far enough away as possible so that police will not think you are refusing to disperse. If you are arrested while trying to leave, the further away you are, the better you or your attorney's ability to show that you were trying to comply with the order to disperse will be, if charges are brought against you.",
            "When they give orders to disperse, police should provide a clear, safe way to leave the area of the protest. But again, police don't always follow the law. We've seen the improper use of police 'kettles' — where police give orders to disperse but don't leave a safe way for people to get out. Or they don't allow people enough time to get out of an area, and start making arrests or using force against protesters.",
            "If that happens, there is little that you can do about it in the moment, but there may be an opportunity to bring a lawsuit against the police after the fact.",
            "Documentation by protesters and the media of police abuses can be helpful for public accountability, transparency, and even litigation against police later, but be aware that it may also end up being used by police and prosecutors to identify or prosecute protesters."
          ]
        }
      ]
    },
    {
      "title": "Can undercover police legally monitor protest activities?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Generally, yes, undercover police may monitor protesters' online postings, attend public protests, record or photograph demonstrators, or attend planning meetings to learn about planned protest activities."
          ]
        }
      ]
    },
    {
      "title": "Do I have to show ID if police demand it?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Not in Iowa. If you are detained or arrested, you may choose to show ID when police demand it, or choose not to show ID. If you choose not to show ID, you could be detained for a longer time while police attempt to identify you."
          ]
        }
      ]
    },
    {
      "title": "Can police search demonstrators?",
      "subsections": [
        {
          "title": "",
          "items": [
            "If police have reasonable suspicion that you are involved in or about to commit criminal activity, they can stop you, and if they have reasonable suspicion that you are armed, they can also frisk your outer clothing to search for weapons."
          ]
        }
      ]
    },
    {
      "title": "Can police search bags and containers without probable cause?",
      "subsections": [
        {
          "title": "",
          "items": [
            "Police and security can search bags only if they have probable cause that it contains contraband, weapons, or evidence of illegal activity. However, if you are entering a secure area, like a federal building or a courthouse, police and security can indeed search your bags."
          ]
        }
      ]
    },
    {
      "title": "I've been arrested for protesting. Who can help?",
      "subsections": [
        {
          "title": "",
          "items": [
            "The ACLU of Iowa Legal Department is not a legal aid services organization. We bring a select number of impact cases to defend and promote the fundamental guarantees of individual liberties protected by the federal and state constitutions. If in Iowa and feel your constitutional rights have been violated, email the ACLU of Iowa legal program: legal.program@aclu-ia.org.",
            "The National Lawyers Guild (NLG) in Iowa may be able to help you find a lawyer. The Iowa contact is Sally Frank at sally.frank@drake.edu or 515-271-3909.",
            "If you need assistance with bail funds, you can contact the Prairielands Freedom Fund at 319-535-2209 or the Des Moines Mutual Aid Bail Fund at 515-218-1994."
          ]
        }
      ]
    }
  ]
}
