{
  "sources": "https://www.acluva.org/en/know-your-rights/know-your-rights-demonstrations-and-protests",
  "intro": {
    "title": "Know Your Rights: Demonstrations and Protests",
    "text": "You have the right to express yourself, gather peacefully, and ask your government to address your concerns. The government can set rules regulating these activities. But, the regulations cannot favor one side over another and must be necessary to protect public safety and order. The rules regarding permits and the use of public property may vary depending on where you are. It is important that you understand the rules that apply to the location that you are in."
  },
  "sections": [
    {
      "title": "General Guidelines",
      "subsections": [
        {
          "title": "What speech activities are protected by the First Amendment?",
          "items": [
            "Making speeches, handing out leaflets, holding or attending rallies, carrying posters, and demonstrating are protected activities. The First Amendment covers all forms of communication, including music, theatre, film, and dance. It also protects actions that symbolically express a viewpoint: for example, wearing costumes or holding a candlelight vigil."
          ]
        },
        {
          "title": "Can my free speech rights be restricted because of what I say – even if it's controversial?",
          "items": [
            "No, the First Amendment prohibits restrictions based on the content of a person's speech. However, this does not mean that the First Amendment completely protects all types of free speech activity in every circumstance. Police and government officials are allowed to place certain nondiscriminatory and narrowly drawn \"time, place and manner\" restrictions on the exercise of First Amendment rights."
          ]
        },
        {
          "title": "Can a speaker be silenced for provoking a crowd?",
          "items": [
            "Generally, no. Even the most inflammatory speaker cannot be punished for merely arousing the audience. A speaker can be convicted for incitement only if he or she specifically advocates illegal actions and only if such illegal conduct is likely to imminently occur."
          ]
        },
        {
          "title": "Do counter-demonstrators have free speech rights?",
          "items": [
            "Yes. Although counter-demonstrators should not be allowed to physically disrupt the event they are protesting, they do have the right to be present and to voice their displeasure. Police are permitted to keep two antagonistic groups separated but should allow them to be within sight and sound of one another."
          ]
        }
      ]
    },
    {
      "title": "Permits and Public Property",
      "subsections": [
        {
          "title": "Do I need a permit before I engage in free speech activity?",
          "items": [
            "Not usually. However, certain types of events require permits. Generally, these events include:",
            "• A march or parade that does not stay on the sidewalk and other events that require blocking traffic or street closure",
            "• A large rally requiring the use of sound amplifying devices; or",
            "• A rally at certain designated parks or plazas",
            "Many permit procedures require that the application be filed several weeks in advance of the event. However, the First Amendment prohibits such an advance notice requirement from being used to prevent rallies or demonstrations that are rapid responses to unforeseeable and recent events."
          ]
        },
        {
          "title": "Where can I engage in free speech activity?",
          "items": [
            "Generally, all types of expression are constitutionally protected in traditional \"public forums\" such as streets, sidewalks, and parks. In addition, you may have a right to speak in other public locations that the government has opened up to similar speech activities, such as the plazas in front of government buildings.",
            "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
            "Protesters and demonstrators may be required to remain a certain distance away from a building or facility that is the target of the demonstration."
          ]
        },
        {
          "title": "What about free speech activity on government property that isn't a public forum?",
          "items": [
            "Free speech activities may be subject to greater restrictions when they take place on government property that has not been opened to the general public for such activities, such as military bases or the grounds of a state capitol. However, the Supreme Court has recognized that the public's First Amendment interest in observing government operations can outweigh the government's interest in restricting access to certain government functions. It is very difficult for the government to pass a law that restricts such activities as a matter of public policy."
          ]
        }
      ]
    },
    {
      "title": "Rights of Demonstrators",
      "subsections": [
        {
          "title": "Can my free speech rights be restricted because of what I say – even if it's controversial?",
          "items": [
            "No, the First Amendment prohibits restrictions based on the content of a person's speech. However, this does not mean that the First Amendment completely protects all types of free speech activity in every circumstance. Police and government officials are allowed to place certain nondiscriminatory and narrowly drawn \"time, place and manner\" restrictions on the exercise of First Amendment rights."
          ]
        },
        {
          "title": "If organizers have not obtained a permit, where can a march take place?",
          "items": [
            "If marchers stay on the sidewalk and obey traffic and pedestrian signals, their activity is constitutionally protected even without a permit. Marchers may be required to allow enough space on the sidewalk for normal pedestrian traffic and may not maliciously obstruct or detain passers-by."
          ]
        },
        {
          "title": "May I distribute leaflets and other literature on public sidewalks?",
          "items": [
            "Yes. You may approach pedestrians on public sidewalks with leaflets, newspapers, petitions, and solicitations for donations without a permit. Tables may also be set up on sidewalks for these purposes if sufficient room is left for pedestrians to pass. These types of free speech activities are legal as long as entrances to buildings are not blocked and passers-by are not physically and maliciously detained. However, a permit may be required to set up a table."
          ]
        }
      ]
    },
    {
      "title": "Photography and Recording Rights",
      "subsections": [
        {
          "title": "Is it legal to photograph or videotape police officers?",
          "items": [
            "Yes, as long as you do not physically interfere with them. Police officers may not generally confiscate or demand to view your photographs or video without a warrant, nor may they delete your photographs or video under any circumstances."
          ]
        },
        {
          "title": "What if police officers order me to stop taking pictures or video?",
          "items": [
            "If police officers order you to stop filming or photographing them, you should comply to avoid arrest or being forcibly restrained. However, such an order may be unlawful. If police officers say you are interfering with their actions by taking photographs or video, you should explain that you are not interfering and that the First Amendment gives you the right to take photographs or video. You should not physically resist an officer who tries to take your camera. As with all police orders, you may challenge the officer's actions later if you feel your rights were violated."
          ]
        }
      ]
    }
  ]
}
