{
  "sources": "https://www.laaclu.org/en/know-your-rights/protest",
  "intro": {
    "title": "Know Your Rights: Protesters' Rights",
    "text": "The First Amendment stands as a guardian of your right to assemble and express your views through protest, no matter how unpopular they may be. You have the freedom to critique the president, Congress, or the chief of police without any fear of retaliation. However, government officials and entities, including police, are allowed to place certain narrow restrictions on the exercise of speech rights."
  },
  "sections": [
    {
      "title": "Limits on Speech Protections",
      "subsections": [
        {
          "title": "Unprotected Speech",
          "items": [
            "It is crucial to remember that the First Amendment does not shield you from engaging in libel, slander, obscenity, or speech that is a \"true threat\" to imminent violence or law-breaking. A \"true threat\" is a statement that a reasonable person would interpret as a serious expression of an intent to commit an act of unlawful violence to a particular individual or group. For example, if you were to take hold of a megaphone during a riot and urge others to \"shoot the cop\" or \"loot the shop,\" you would be making a \"true threat\" and can expect to face consequences."
          ]
        },
        {
          "title": "Can I talk about government overthrow or taking over the streets?",
          "items": [
            "When discussing the sensitive topics of government overthrow or taking over the streets, it's crucial to understand the legal limits. In the past, individuals suspected of being subversive or holding communist views were often charged with \"incitement to illegal activity\" and convicted.",
            "However, courts now require a higher standard the government must prove to restrict speech. This understanding should empower you to engage in meaningful discourse while staying within legal boundaries.",
            "In general, individuals have the right to discuss ideas or future events. This fundamental protection ensures that open discussion about ideas and future events is always safeguarded. However, the government can prohibit speech that is likely to incite or produce imminent lawless action. This means that while open discussion is protected, speech that directly encourages or leads to imminent illegal activity can be prohibited."
          ]
        },
        {
          "title": "What if others react violently to what I say?",
          "items": [
            "If you plan a legal protest, you might be held responsible if people at the protest commit illegal acts.",
            "In Louisiana, a new racketeering statute now includes inciting a riot and criminal damage to property. This change will negatively impact protest organizers. For example: Suppose you organize a protest that turns violent and are charged with inciting a riot or criminal damage to property. In that case, if you organize another protest and are charged or arrested again, you could be charged under the racketeering statute. This would lead to enhanced penalties of a maximum of 50 years with hard labor and a $1 million fine. (La. Revised Statute 15:1352(A)(71-87))",
            "It is important to note that you are not responsible for how counter-demonstrators react to your message. While counter demonstrators have the right to be present, it is the police's responsibility to control the crowd. You are not liable for the way that counter demonstrators react to your message. This knowledge will help you feel secure in your rights and responsibilities during a protest."
          ],
          "link": {
            "text": "La. Revised Statute 15:1352(A)(71-87)",
            "url": "https://legis.la.gov/Legis/Law.aspx?d=79459"
          }
        }
      ]
    },
    {
      "title": "Navigating the Permit Process",
      "subsections": [
        {
          "title": "When do I need a permit?",
          "items": [
            "Whether you are marching on city hall, holding a candlelight vigil, or picketing outside a private business or residence, you should check your local permit ordinance before you organize your event.",
            "While regulations vary, here are some guidelines:",
            "The government cannot prohibit marches on public sidewalks or streets, or rallies in most public parks or plazas. However, it can often require a permit to regulate competing uses of the area and to ensure you respect reasonable time, place, and manner restrictions.",
            "You do not need a permit to march in the streets or on sidewalks, as long as marchers do not obstruct car or pedestrian traffic. If you do not have a permit, police officers can ask you to move to the side of a street or sidewalk to let others pass or for safety reasons.",
            "You should not need a permit for demonstrations that do not \"realistically present serious traffic, safety, and competing-use concerns beyond those presented on a daily basis by ordinary use of the streets and sidewalks.\" If you hold a small rally in a public park or march on the sidewalk and obey traffic laws, you generally won't need a permit.",
            "If a permit is not obtained, law enforcement has the authority to move protesters to the sidewalk. Those who fail to comply with police orders may be subject to arrest, including while on the sidewalk.",
            "While certain permit procedures require applying well in advance of the planned event, police cannot use those procedures to prevent a protest in response to breaking news events.",
            "A permit cannot be denied because the event is controversial or will express unpopular views.",
            "Local governments often require permits for events such as marches or parades that require blocking traffic or street closure, large rallies requiring the use of sound amplifying devices, or rallies over a certain size at most parks or plazas.",
            "In Louisiana, if you plan or organize a protest without a permit and block a pipeline, refinery, highway, road, railway, airport runway, or navigable waterway, you can face a fine of up to $750 and/or six months in jail. This offense doesn't require a protest or other action to occur or block traffic (La. Revised Statute 14:97)."
          ],
          "link": {
            "text": "La. Revised Statute 14:97",
            "url": "https://legis.la.gov/Legis/Law.aspx?d=78391"
          }
        },
        {
          "title": "When should I apply for my permit?",
          "items": [
            "Most permit ordinances require that an application be submitted a few days in advance, so be sure to give officials sufficient notice. Advance notice periods should be days, not weeks, and there should be an exception to allow demonstrations responding to breaking news. Some activists have successfully challenged ordinances that fail to meet these standards."
          ]
        },
        {
          "title": "When can the city deny my permit?",
          "items": [
            "A municipality must have precise standards for denying a permit. An ordinance with no standards or vague standards (such as a denial along the lines of \"will not disturb others\" or \"in the public interest\" or \"in the interest of vehicular or pedestrian traffic safety\") gives individual officials too much discretion. Such an ordinance is unconstitutional, and you cannot be lawfully punished for violating it. If the government denies you a permit for expressive activity, it should tell you why it has done so."
          ]
        },
        {
          "title": "What if past marches have turned violent?",
          "items": [
            "The government cannot deny a permit because past demonstrations by your group or others ended in civil disobedience or a disorderly brawl. Likewise, officials cannot ask you to promise that protesters will obey the law before agreeing to issue your permit.",
            "In Louisiana, the racketeering statute now includes inciting a riot and criminal damage to property. If you organize a riot and are charged with inciting a riot or criminal damage to property, and then you organize another protest and are charged or arrested again, you could be charged under the racketeering statute. This would lead to enhanced penalties of up to 50 years with hard labor and a $1 million fine. (La. Revised Statute 15:1352(A)(71-87))"
          ],
          "link": {
            "text": "La. Revised Statute 15:1352(A)(71-87)",
            "url": "https://legis.la.gov/Legis/Law.aspx?d=79459"
          }
        },
        {
          "title": "Can the city ask me to cover the costs of my protest?",
          "items": [
            "Cities may charge for the actual costs of a demonstration, including the costs of processing permits, traffic control, certain narrow insurance requirements, and some clean-up costs. However, you may challenge excessive fees. If the permit regulations that apply to your protest require a fee for a permit, they should allow a waiver for those who cannot afford the charge."
          ]
        },
        {
          "title": "How much noise can I make?",
          "items": [
            "The answer varies from city to city and also depends on the time and place you are speaking. Still, one general principle applies: You may use amplification devices as long as you intend to communicate your message and not disturb the peace. The government may require permits for music, drums, and loudspeakers, but ordinances should be narrowly tailored to prevent excessive noise without interfering with your free-speech rights. According to Louisiana law, excessive noise is when the sound emanating from the sound amplification system is audible at a distance of greater than 25 feet, which exceeds eighty-five decibels. Check your local regulations. You may not need a permit to use a bullhorn or megaphone, but the government may ban noisy parties without a purpose or sound that is deemed to be amplified to a loud and raucous volume. (La. Revised Statute 14:103)"
          ],
          "link": {
            "text": "La. Revised Statute 14:103",
            "url": "https://legis.la.gov/Legis/Law.aspx?d=78397"
          }
        }
      ]
    },
    {
      "title": "Civil Disobedience",
      "subsections": [
        {
          "title": "",
          "items": [
            "Civil disobedience is the active refusal to comply with specific laws as a form of protest. If you plan to block an intersection or lie down in the middle of the street, ensure you know your rights before you begin. Take time to familiarize yourself with the practical consequences of civil disobedience and the steps you can take to minimize your chances of being arrested.",
            "Familiarize yourself with our guide, 'Know Your Rights: Interacting with the Police,' and make sure you understand what you can and cannot do when interacting with the police.",
            "If you are an undocumented person participating in civil disobedience, the government may communicate your arrest to the U.S. Immigration and Customs Enforcement, which could affect your immigration status and even result in your deportation.",
            "You may be held in custody if there is a warrant out for your arrest."
          ]
        }
      ]
    },
    {
      "title": "Your Rights on Arrest",
      "subsections": [
        {
          "title": "What should I expect if I'm arrested at a protest?",
          "items": [
            "What should I expect if I'm arrested at a protest?",
            "What you can expect depends on what you are arrested for. There are three different types of offenses: infractions, such as littering or failing to yield to traffic in the street; misdemeanors, such as obstructing an officer or disturbing the peace; and felonies, such as criminal damage to property over one thousand dollars.",
            "Infractions:",
            "For almost all infractions in Louisiana, if you can show a government-issued ID, the police must give you a citation (formally known as a 'summons') and release you on the spot.",
            "Misdemeanors:",
            "In Louisiana, if you are arrested for a misdemeanor, the police will take you to the station to be fingerprinted and photographed. You will be held until bail is set, which must be within 72 hours of your arrest.",
            "Felonies:",
            "For felonies, under Louisiana law, if you are arrested, you must be brought before a judge within 72 hours to be informed of the charges against you and will be held until bail is set and paid. (La. Code of Criminal Procedure 230.1)",
            "What can the police charge me with?",
            "Even if you view your expressive activity as lawful, there's a chance that the police will regard it as over the line. So, whether you are planning to engage in civil disobedience or not, you should be familiar with the Louisiana statutes most often invoked against demonstrators:",
            "Resisting arrest or obstruction of a peace officer (La. Revised Statute 14:109)",
            "Disturbing the peace (La. Revised Statute 14:103)",
            "Inciting a riot (La. Revised Statute 14:329.2)",
            "Failure to disperse (La. Revised Statute 14:329.3)",
            "Trespassing (La. Revised Statute 14:63)"
          ]
        }
      ]
    },
    {
      "title": "Limits to Police Power",
      "subsections": [
        {
          "title": "When can the police break up a protest or demonstration?",
          "items": [
            "The police are charged with safeguarding the public during a demonstration, but they cannot use their powers to stop you from exercising your free-speech rights. As long as you are observing reasonable time, place, and manner restrictions, the police may not break up a gathering unless there is an imminent danger of a riot, disorder, traffic interference, or a threat to public safety.",
            "Police officers may not use their powers in a way that discourages ordinary people from expressing their views. Suppose officers do decide to give a dispersal order. In that case, they must provide actual notice of the order and allow a reasonable opportunity to comply, which includes sufficient time and a clear and unobstructed exit path."
          ]
        }
      ]
    },
    {
      "title": "Best Locations for Free Speech Activities",
      "subsections": [
        {
          "title": "What's the best location for my free-speech activity?",
          "items": [
            "Although the First Amendment gives you the right to decide where best to express yourself, your ability to exercise your free-speech rights may hinge upon exactly where you choose to exercise those rights. The Supreme Court of the United States uses a Federal Forum Analysis to determine what kinds of speech are appropriate in which public locations."
          ]
        },
        {
          "title": "Traditional Public Forums",
          "items": [
            "Is it a sidewalk, a street, or a public park? If the answer is yes, you are protesting at a traditional public forum, where speech may only be restricted through reasonable time, place, and manner restrictions. Remember that protesting, demonstrating, or picketing in critical infrastructure areas, such as gas and oil pipelines, refineries, plants, ports, or railways, is prohibited in Louisiana."
          ]
        },
        {
          "title": "Designated Public Forums",
          "items": [
            "Other spaces may receive the same protection as traditional forums because the government has opened them up to be used for speech activities. Once the government treats a public venue as available to some for non-commercial speech, it must be made available to all. Common examples of designated public forums include public auditoriums, the steps of city hall, and plazas in front of public buildings."
          ]
        },
        {
          "title": "Non-Public Forums",
          "items": [
            "Your rights are less clearly protected in other venues. At military bases, airport terminals, or the entrance to a post office, for example, reasonable prohibitions and restrictions may be upheld as long as they are objectively applied and do not favor one side of an issue over the other. The government cannot discriminate based on viewpoint, even in a non-public forum."
          ]
        },
        {
          "title": "Private Property and Residential Areas",
          "items": [
            "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your property or with the consent of the property owner.",
            "You cannot petition, protest, demonstrate, or gather within fifty feet of someone's home in a way that disturbs, threatens to disturb, or bothers the person's right to control or use their home.",
            "NOTE: Counter-protesters also have free speech rights. Police must treat protesters and counter-protesters equally. Police are permitted to separate antagonistic groups, but should allow them to be within sight and sound of one another."
          ]
        },
        {
          "title": "Can public universities or college campuses restrict protests?",
          "items": [
            "You should be allowed to protest on the outdoor streets and plazas of public college and university campuses, subject to reasonable time, place, or manner restrictions. A public college cannot allow protests on one side of an issue, but prohibit protests on the other. It may restrict speech activities that unduly interfere with classes."
          ]
        }
      ]
    }
  ]
}
