{
  "sources": "https://www.acluofnorthcarolina.org/en/know-your-rights/demonstrations-and-protests",
  "intro": {
    "title": "Demonstrations and Protests",
    "text": "The right to join with fellow citizens in protest or peaceful assembly is critical to a functioning democracy. But it is also unfortunately true that governments and police can violate this right – through the use of mass arrests, illegal use of force, criminalization of protest, and other means intended to thwart free public expression. Standing up for your right to protest can be challenging, especially when demonstrations are met with violence. But knowing your rights is the most powerful weapon you have against police abuse."
  },
  "sections": [
    {
      "title": "General Guidelines",
      "subsections": [
        {
          "title": "Can my free speech be restricted because of what I say—even if it is controversial?",
          "items": [
            "No. The First Amendment prohibits restrictions based on the content of speech. However, this does not mean that the Constitution completely protects all types of free speech activity in every circumstance. Police and government officials are allowed to place certain nondiscriminatory and narrowly drawn \"time, place and manner\" restrictions on the exercise of First Amendment rights. Any such restrictions must apply to all speech regardless of its point of view."
          ]
        },
        {
          "title": "Where can I engage in free speech activity?",
          "items": [
            "Generally, all types of expression are constitutionally protected in traditional \"public forums\" such as streets, sidewalks and parks. In addition, your speech activity may be permitted to take place at other public locations that the government has opened up to similar speech activities, such as the plazas in front of government buildings.",
            "What about free speech activity on private property? The general rule is that the owners of private property may set rules limiting your free speech. If you disobey the property owner's rules, they can order you off their property (and have you arrested for trespassing if you do not comply)."
          ]
        },
        {
          "title": "Do I need a permit before I engage in free speech activity?",
          "items": [
            "Not usually. However, certain types of events require permits. Generally, these events are:",
            "A march or parade that does not stay on the sidewalk, and other events that require blocking traffic or street closure",
            "A large rally requiring the use of sound amplifying devices; or",
            "A rally at certain designated parks or plazas",
            "Many permit procedures require that the application be filed several weeks in advance of the event. However, the First Amendment prohibits such an advance notice requirement from being used to prevent rallies or demonstrations that are rapid responses to unforeseeable and recent events. Also, many permit ordinances give a lot of discretion to the police or city officials to impose conditions on the event, such as the route of a march or the sound levels of amplification equipment. Such restrictions may violate the First Amendment if they are unnecessary for traffic control or public safety, or if they interfere significantly with effective communication with the intended audience. A permit cannot be denied because the event is controversial or will express unpopular views."
          ]
        },
        {
          "title": "If organizers have not obtained a permit, where can a march take place?",
          "items": [
            "If marchers stay on the sidewalks and obey traffic and pedestrian signals, their activity is constitutionally protected even without a permit. Marchers may be required to allow enough space on the sidewalk for normal pedestrian traffic and may not maliciously obstruct or detain passers-by."
          ]
        },
        {
          "title": "May I distribute leaflets and other literature on public sidewalks?",
          "items": [
            "Yes. You may approach pedestrians on public sidewalks with leaflets, newspapers, petitions and solicitations for donations without a permit. You may also be allowed to set up a table for this purpose, but a permit may be required to do so. These types of free speech activities are legal as long as entrances to buildings are not blocked and passers-by are not physically blocked or maliciously detained."
          ]
        },
        {
          "title": "Do I have a right to picket on public sidewalks?",
          "items": [
            "Yes, and this is also an activity for which a permit is not required. However, picketing must be done in an orderly, non-disruptive fashion so that pedestrians can pass by and entrances to buildings are not blocked."
          ]
        },
        {
          "title": "Can government impose a financial charge on exercising free speech rights?",
          "items": [
            "Some local governments have required a fee as a condition of exercising free speech rights, such as application fees, security deposits for clean-up, or charges to cover overtime police costs. Charges that cover actual administrative costs have been permitted by some courts. However, if the costs are greater because an event is controversial (or a hostile crowd is expected)—such as requiring a large insurance policy—then the courts will not permit it. Also, regulations with financial requirements should include a waiver for groups that cannot afford the charge, so that even grassroots organizations can exercise their free speech rights. Therefore, a group without significant financial resources should not be prevented from engaging in a march simply because it cannot afford the charges the City would like to impose."
          ]
        },
        {
          "title": "Do counter-demonstrators have free speech rights?",
          "items": [
            "Yes. Although counter-demonstrators should not be allowed to physically disrupt the event they are protesting, they do have the right to be present and to voice their displeasure. Police are permitted to keep two antagonistic groups separated but should allow them to be within the general vicinity of one another."
          ]
        },
        {
          "title": "Does it matter if other speech activities have taken place at the same location?",
          "items": [
            "Yes. The government cannot discriminate against activities because of the controversial content of the message. Thus, if you can show that similar events to yours have been permitted in the past (such as a Veterans or Memorial Day parade), then that is an indication that the government is involved in selective enforcement if they are not granting you a permit."
          ]
        },
        {
          "title": "What other types of free speech activity are constitutionally protected?",
          "items": [
            "The First Amendment covers all forms of communication including music, theater, film and dance. The Constitution also protects actions that symbolically express a viewpoint. Examples of these symbolic forms of speech include wearing masks and costumes or holding a candlelight vigil. However, symbolic acts and civil disobedience that involve illegal conduct may be outside the realm of constitutional protections and can sometimes lead to arrest and conviction. For example, while sitting in a road may be expressing a political opinion, the act of blocking traffic may lead to criminal punishment."
          ]
        },
        {
          "title": "What should I do if my rights are being violated by a police officer?",
          "items": [
            "It rarely does any good to argue with a street patrol officer. Ask to talk to a supervisor and explain your position to him or her. Point out that you are not disrupting anyone else's activity and that the First Amendment protects your actions. If you do not obey an officer, you might be arrested and taken from the scene."
          ]
        }
      ]
    }
  ]
}
