{
  "sources": "https://www.aclu-tn.org/en/know-your-rights/your-right-protest-tennessee",
  "intro": {
    "title": "Your Right to Protest in Tennessee",
    "text": "Designed to empower readers with an understanding of the ins and outs of exercising their First Amendment right to peaceably assemble, this pamphlet provides answers to your questions about protesting in Tennessee, including the difference between protesting on public and private property; our state's regulations, requirements, and restrictions on public assembly; and the nuances of public protests in the Post-9/11 era."
  },
  "sections": [
    {
      "title": "The First Amendment Guarantees",
      "content": [
        "The First Amendment to the U.S. Constitution protects 'the right of the people peaceably to assemble.' This right is incorporated against the states through the Fourteenth Amendment, which means that state and local governments must respect and protect the right to protest."
      ]
    },
    {
      "title": "Protesting in Public Forums",
      "content": [
        "Public forums such as streets, sidewalks, and parks are traditional venues for protests and demonstrations. Government may regulate the time, place, and manner of speech in these areas only if the regulations are content-neutral, narrowly tailored to serve a significant governmental interest, and leave open ample alternative channels for communication."
      ]
    },
    {
      "title": "Protesting on Private Property",
      "content": [
        "Private property owners can set their own rules for speech on their property. In most cases, you do not have a First Amendment right to engage in free speech activities on private property against the wishes of the property owner."
      ]
    },
    {
      "title": "Do I need a permit to hold a protest?",
      "content": [
        "Many local governments require permits for demonstrations, parades, or large assemblies in public places. These requirements are constitutional so long as they are reasonable, content-neutral, and narrowly tailored to serve significant governmental interests such as traffic control and public safety.",
        "Permit requirements must not be used to prevent spontaneous demonstrations in response to breaking news events.",
        "If the permit regulations that apply to your protest require a fee for a permit, they should allow a waiver for those who cannot afford the charge."
      ]
    },
    {
      "title": "Can the government restrict what I can say?",
      "content": [
        "Generally, the First Amendment prohibits government from restricting speech based on its content or viewpoint. However, there are some narrow categories of speech that are not protected, including:",
        "• Speech that incites others to imminent lawlessness",
        "• True threats",
        "• Fighting words (face-to-face personal insults that would likely provoke a violent reaction)",
        "• Obscenity"
      ]
    },
    {
      "title": "What do I do if I am stopped by law enforcement while protesting?",
      "content": [
        "• Stay calm and be polite",
        "• Do not physically resist officers",
        "• Ask if you are free to leave. If the officer says yes, calmly walk away",
        "• If you are under arrest, you have a right to ask why",
        "• You have the right to remain silent and to talk to a lawyer",
        "• You do not have to consent to a search of yourself or your belongings"
      ]
    },
    {
      "title": "What if my rights have been violated?",
      "content": [
        "• Write down everything you remember, including officers' badge and patrol car numbers",
        "• Get contact information from witnesses",
        "• Take photographs of any injuries",
        "• Once you have gathered this information, you can file a complaint with the agency's internal affairs division or civilian complaint board"
      ]
    },
    {
      "title": "Photography and Recording at Protests",
      "content": [
        "When you are lawfully present in a public space, you have the right to photograph or record anything in plain view, including police activity. Police may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances."
      ]
    }
  ]
}
