{
  "sources": "https://www.riaclu.org/en/know-your-rights/know-your-rights-protests-demonstrations",
  "intro": {
    "title": "Know Your Rights: Protests, Marches and Demonstrations",
    "text": "Know your rights when it comes to protests, marches and demonstrations."
  },
  "sections": [
    {
      "title": "Can my speech be restricted just because it is unpopular or controversial?",
      "content": [
        "No. You cannot be barred from speaking simply because others may disagree with what you have to say. However, there are some restrictions on the types of speech the Constitution protects. For example, the First Amendment does not protect speech that incites imminent violence."
      ]
    },
    {
      "title": "Where can I hold protest or demonstration?",
      "content": [
        "In most cases, all types of expression are constitutionally protected in traditional \"public forums\" such as streets, sidewalks and parks. These are places where people have a reasonable expectation of being able to freely communicate their opinions with the fewest possible government limitations. Nevertheless, officials do have the authority to place reasonable time, place and manner restrictions on demonstrations. Your rights at various locations are described below."
      ],
      "subsections": [
        {
          "title": "SIDEWALKS",
          "items": [
            "Picketing, marching, or speaking on a public sidewalk is allowable, but should be done in a non-disruptive manner so that pedestrians can pass and entrances to buildings are not blocked. You do not need a permit for small gatherings or to approach pedestrians with leaflets, newspapers, and petitions."
          ]
        },
        {
          "title": "PARKS",
          "items": [
            "Public parks are the most traditional public forums. Like the other locations listed in this pamphlet, the government can place reasonable time, place, and manner restrictions on demonstrations in public parks. Certain areas may require a permit for large rallies or demonstrations"
          ]
        },
        {
          "title": "GOVERNMENT BUILDINGS",
          "items": [
            "Free speech activity may also take place at other public locations that the government has opened up for First Amendment use, such as the plazas in front of government buildings. However, not every property owned by the government is a traditional public forum. For example, a government office building may exclude anyone who is not conducting business there, so that employees are able to do their work. The degree of public access depends on the type of building and the history of past use at the particular building."
          ]
        },
        {
          "title": "PUBLIC SCHOOLS",
          "items": [
            "During the school day, school administrators and officials have the right to restrict access to school property in order to ensure that the school is a safe and orderly place for students. As a result, schools generally do not allow non-students to hand out literature or engage in other forms of communication on school property during the school day. However, it is legal to picket or leaflet near school grounds, such as on a public sidewalk. At other times, if school officials have allowed any non-student group to use school facilities, they must allow access to other groups on a comparable basis. This means that a school cannot keep certain groups out simply because officials disagree with their views."
          ]
        },
        {
          "title": "POST OFFICES",
          "items": [
            "Free speech relating to partisan political activity is prohibited at post offices. It is also illegal to post handbills or flyers on postal property."
          ]
        },
        {
          "title": "POLLING PLACES",
          "items": [
            "When a public building is being used as a polling place, partisan political speech and activity, including campaign signs, are barred within 50 feet of the polling place entrance. However, state law gives you the right to wear political shirts, buttons, or stickers when you are voting."
          ]
        }
      ]
    },
    {
      "title": "Can the police establish \"protest zones\" at events that are expected to draw large crowds?",
      "content": [
        "Probably. \"Protest zones\" at events like presidential speeches or political conventions are becoming more common, but they do raise some constitutional questions. It is probably permitted for law enforcement to place reasonable time, place and manner restrictions on a demonstration, such as keeping a large group of protesters across the street from the event they are protesting. However, it is questionable for law enforcement to place unreasonable restrictions on a protest, such as instituting a protest zone several blocks away and out of sight of the event in question."
      ]
    },
    {
      "title": "Can I engage in a counter-protest?",
      "content": [
        "Yes. Although counter-protesters should not be allowed to physically disrupt the event they are protesting, they do have the right to be present and to voice their opinions. Police are permitted to keep two antagonistic groups separated but should allow them to be within the general vicinity of one another."
      ]
    },
    {
      "title": "What about free speech activity on private property?",
      "content": [
        "Owners of private property, ranging from shopping malls to private residences, may set rules limiting your free speech. If you disobey the property owner's rules, they can order you off their property, and you may be arrested for trespassing if you refuse to comply. There may also be limits on picketing directly in front of a private residence, even if on the sidewalk."
      ]
    },
    {
      "title": "Are there restrictions to the format of my protest?",
      "content": [
        "Restrictions vary depending on the place and manner of your demonstration. Information about some common forms of protest are listed below."
      ],
      "subsections": [
        {
          "title": "SPEECHES",
          "items": [
            "You do not need a permit when delivering a speech on a public sidewalk or at similar public forums, even if a large crowd gathers. The mere presence of hecklers or counter-demonstrators is not enough to justify an order to disperse the crowd or arrest the speaker, nor can a person be stopped from speaking because opponents engage in disorderly or illegal conduct."
          ]
        },
        {
          "title": "PICKETING & LEAFLETING",
          "items": [
            "Picketing or handing out literature on a public sidewalk is legal as long as the activity does not cause traffic problems or hinder pedestrian travel. However, protesters cannot force people to accept their pamphlets or otherwise coerce passers-by to engage with them. You do not need a permit to picket or leaflet on a public sidewalk. You also have the right to canvass and leaflet door-to-door at private residences. Nevertheless, there are some restrictions to this practice. For example, one cannot leaflet at a residence with \"no trespassing\" or \"no soliciting\" signs. Additionally, if an individual does not leave private property after being asked to do so, he or she can be arrested for trespassing. It is also illegal to put material for which no postage has been paid in residential mailboxes."
          ]
        },
        {
          "title": "MARCHES & PARADES",
          "items": [
            "Marches on public sidewalks do not require permits. As with speeches and picketing, marches on sidewalks can go as far as they like as long as demonstrators observe traffic laws and leave room for other pedestrian traffic. However, marches or parades that take place in the street and that would stop or slow traffic will likely require a permit."
          ]
        },
        {
          "title": "SOUND EQUIPMENT",
          "items": [
            "A city can restrict the volume of sound or specify that the use of sound equipment be confined to certain times or areas. However, some noise ordinances can be legally challenged if they are unduly vague or give police broad discretion to determine what constitutes a violation of the ordinance. If you are planning to use sound equipment at a demonstration, check local ordinances or contact local authorities beforehand to find out if you will need a permit."
          ]
        }
      ]
    }
  ]
}
