{
  "sources": "https://www.acluct.org/en/know-your-rights/know-your-rights-free-speech",
  "intro": {
    "title": "Know Your Rights: Free Speech",
    "text": "The First Amendment protects your right to assemble and express your views through protest. However, police and other government officials are allowed to place certain narrow restrictions on the exercise of speech rights. Make sure you're prepared by brushing up on your rights before heading out into the streets."
  },
  "sections": [
    {
      "title": "I'm organizing a protest",
      "subsections": [
        {
          "title": "Your rights",
          "items": [
            "Your rights are strongest in what are known as \"traditional public forums,\" such as streets, sidewalks, and parks. You also likely have the right to speak out on other public property, like plazas in front of government buildings, as long as you are not blocking access to the government building or interfering with other purposes the property was designed for.",
            "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
            "Counterprotesters also have free speech rights. Police must treat protesters and counterprotesters equally. Police are permitted to keep antagonistic groups separated but should allow them to be within sight and sound of one another.",
            "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. On private property, the owner may set rules related to photography or video."
          ]
        },
        {
          "title": "Do I need a permit?",
          "items": [
            "You don't need a permit to march in the streets or on sidewalks, as long as marchers don't obstruct car or pedestrian traffic. If you don't have a permit, police officers can ask you to move to the side of a street or sidewalk to let others pass or for safety reasons.",
            "Certain types of events may require permits. These include a march or parade that requires blocking traffic or street closure; a large rally requiring the use of sound amplifying devices; or a rally over a certain size at most parks or plazas.",
            "While certain permit procedures require submitting an application well in advance of the planned event, police can't use those procedures to prevent a protest in response to breaking news events.",
            "Restrictions on the route of a march or sound equipment might violate the First Amendment if they are unnecessary for traffic control or public safety, or if they interfere significantly with effective communication to the intended audience.",
            "A permit cannot be denied because the event is controversial or will express unpopular views.",
            "If the permit regulations that apply to your protest require a fee for a permit, they should allow a waiver for those who cannot afford the charge."
          ]
        },
        {
          "title": "What to do if you believe your rights have been violated",
          "items": [
            "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
            "Get contact information for witnesses.",
            "Take photographs of any injuries.",
            "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
          ]
        }
      ]
    },
    {
      "title": "I'm attending a protest",
      "subsections": [
        {
          "title": "Your rights",
          "items": [
            "Your rights are strongest in what are known as \"traditional public forums,\" such as streets, sidewalks, and parks. You also likely have the right to speak out on other public property, like plazas in front of government buildings, as long as you are not blocking access to the government building or interfering with other purposes the property was designed for.",
            "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
            "Counterprotesters also have free speech rights. Police must treat protesters and counterprotesters equally. Police are permitted to keep antagonistic groups separated but should allow them to be within sight and sound of one another.",
            "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. On private property, the owner may set rules related to photography or video."
          ]
        },
        {
          "title": "What happens if the police issues an order to disperse the protest?",
          "items": [
            "Police may not break up a gathering unless there is a clear and present danger of riot, disorder, interference with traffic, or other immediate threat to public safety.",
            "If officers issue a dispersal order, they must provide a reasonable opportunity to comply, including sufficient time and a clear, unobstructed exit path.",
            "Individuals must receive clear and detailed notice of a dispersal order, including how much time they have to disperse, the consequences of failing to disperse, and what clear exit route they can follow."
          ]
        },
        {
          "title": "What to do if you believe your rights have been violated",
          "items": [
            "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
            "Get contact information for witnesses.",
            "Take photographs of any injuries.",
            "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
          ]
        }
      ]
    },
    {
      "title": "I want to take pictures or shoot video at a protest",
      "subsections": [
        {
          "title": "Your rights",
          "items": [
            "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. On private property, the owner may set rules about photography or video.",
            "Police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances. However, they may order citizens to cease activities that are truly interfering with legitimate law enforcement operations."
          ]
        },
        {
          "title": "What to do if you are stopped or detained for taking photographs",
          "items": [
            "Remain calm: never physically resist a police officer.",
            "Determine if free to go: If you are stopped, ask the officer \"Am I free to go?\"",
            "\"Yes\" → Calmly walk away.",
            "\"No\" → You are being detained. Ask the officer what crime you are suspected of committing. And remind the officer that taking photographs is your right under the First Amendment and does not constitute reasonable suspicion of criminal activity."
          ]
        },
        {
          "title": "What to do if you believe your rights have been violated",
          "items": [
            "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
            "Get contact information for witnesses.",
            "Take photographs of any injuries.",
            "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
          ]
        }
      ]
    },
    {
      "title": "I was stopped by the police while protesting",
      "subsections": [
        {
          "title": "Your rights",
          "items": [
            "Determine if free to go: If you are stopped, ask the officer \"Am I free to go?\"",
            "\"Yes\" → Calmly walk away.",
            "\"No\" → You are being detained. Ask the officer what crime you are suspected of committing.",
            "Refuse searches: If an officer wants to search anything beyond patting down the outside of your clothing, say \"I don't consent to searches.\" If you do explicitly consent, it can affect you later in court."
          ]
        },
        {
          "title": "Officers can",
          "items": [
            "\"Pat down\" your clothing if they suspect you have a weapon and may search you after an arrest."
          ]
        },
        {
          "title": "Reduce risks to yourself",
          "items": [
            "Keep your hands visible.",
            "Don't argue, resist, or obstruct the police, even if you believe they are violating your rights."
          ]
        },
        {
          "title": "What to do if you believe your rights have been violated",
          "items": [
            "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
            "Get contact information for witnesses.",
            "Take photographs of any injuries.",
            "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
          ]
        }
      ]
    }
  ]
}
