{
  "sources": "https://www.aclunebraska.org/en/know-your-rights/know-your-rights-protesters-rights",
  "intro": {
    "title": "Know Your Rights: Protesters' Rights",
    "text": "The First Amendment protects your right to assemble and express your views through protest. However, police and other government officials are allowed to place certain narrow restrictions on the exercise of speech rights. Make sure you're prepared by brushing up on your rights before heading out into the streets."
  },
  "sections": [
    {
      "title": "I'm organizing a protest",
      "subsections": [
        {
          "title": "Your rights",
          "items": [
            "Your rights are strongest in what are known as \"traditional public forums,\" such as streets, sidewalks, and parks. You also likely have the right to speak out on other public property, like plazas in front of government buildings, as long as you are not blocking access to the government building or interfering with other purposes the property was designed for.",
            "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
            "Counterprotesters also have free speech rights. Police must treat protesters and counterprotesters equally. Police are permitted to keep antagonistic groups separated but should allow them to be within sight and sound of one another.",
            "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. On private property, the owner may set rules related to photography or video."
          ]
        },
        {
          "title": "Do I need a permit?",
          "items": [
            "You don't need a permit to march in the streets or on sidewalks, as long as marchers don't obstruct car or pedestrian traffic. If you don't have a permit, police officers can ask you to move to the side of a street or sidewalk to let others pass or for safety reasons.",
            "Certain types of events may require permits. These include a march or parade that requires blocking traffic or street closure; a large rally requiring the use of sound amplifying devices; or a rally over a certain size at most parks or plazas.",
            "While certain permit procedures require submitting an application well in advance of the planned event, police can't use those procedures to prevent a protest in response to breaking news events.",
            "Restrictions on the route of a march or sound equipment might violate the First Amendment if they are unnecessary for traffic control or public safety, or if they interfere significantly with effective communication to the intended audience.",
            "A permit cannot be denied because the event is controversial or will express unpopular views.",
            "If the permit regulations that apply to your protest require a fee for a permit, they should allow a waiver for those who cannot afford the charge."
          ]
        },
        {
          "title": "What to do if you believe your rights have been violated",
          "items": [
            "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
            "Get contact information for witnesses.",
            "Take photographs of any injuries.",
            "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
          ]
        }
      ]
    },
    {
      "title": "I'm attending a protest",
      "subsections": [
        {
          "title": "Your rights",
          "items": [
            "Your rights are strongest in what are known as \"traditional public forums,\" such as streets, sidewalks, and parks. You also likely have the right to speak out on other public property, like plazas in front of government buildings, as long as you are not blocking access to the government building or interfering with other purposes the property was designed for.",
            "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
            "Counterprotesters also have free speech rights. Police must treat protesters and counterprotesters equally. Police are permitted to keep antagonistic groups separated but should allow them to be within sight and sound of one another.",
            "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. On private property, the owner may set rules related to photography or video.",
            "You don't need a permit to march in the streets or on sidewalks, as long as marchers don't obstruct car or pedestrian traffic. If you don't have a permit, police officers can ask you to move to the side of a street or sidewalk to let others pass or for safety reasons."
          ]
        },
        {
          "title": "What happens if the police issues an order to disperse the protest?",
          "items": [
            "Shutting down a protest through a dispersal order must be law enforcement's last resort. Police may not break up a gathering unless there is a clear and present danger of riot, disorder, interference with traffic, or other immediate threat to public safety.",
            "If officers issue a dispersal order, they must provide a reasonable opportunity to comply, including sufficient time and a clear, unobstructed exit path.",
            "Individuals must receive clear and detailed notice of a dispersal order, including how much time they have to disperse, the consequences of failing to disperse, and what clear exit route they can follow, before they may be arrested or charged with any crime."
          ]
        },
        {
          "title": "What to do if you believe your rights have been violated",
          "items": [
            "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
            "Get contact information for witnesses.",
            "Take photographs of any injuries.",
            "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
          ]
        }
      ]
    },
    {
      "title": "I want to take pictures or shoot video at a protest",
      "subsections": [
        {
          "title": "Your rights",
          "items": [
            "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police. (On private property, the owner may set rules about photography or video.)",
            "Police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances. However, they may order citizens to cease activities that are truly interfering with legitimate law enforcement operations.",
            "If you are videotaping, be aware that there is an important legal distinction between a visual photographic record (fully protected) and the audio portion of a videotape, which some states have tried to regulate under state wiretapping laws."
          ]
        },
        {
          "title": "What to do if you are stopped or detained for taking photographs",
          "items": [
            "Always remain calm and never physically resist a police officer.",
            "Police cannot detain you without reasonable suspicion that you have or are about to commit a crime or are in the process of doing so.",
            "If you are stopped, ask the officer if you are free to leave. If the answer is yes, calmly walk away.",
            "If you are detained, ask the officer what crime you are suspected of committing, and remind the officer that taking photographs is your right under the First Amendment and does not constitute reasonable suspicion of criminal activity."
          ]
        },
        {
          "title": "What to do if you believe your rights have been violated",
          "items": [
            "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
            "Get contact information for witnesses.",
            "Take photographs of any injuries.",
            "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
          ]
        }
      ]
    },
    {
      "title": "I was stopped by the police while protesting",
      "subsections": [
        {
          "title": "Your rights",
          "items": [
            "Stay calm. Make sure to keep your hands visible. Don't argue, resist, or obstruct the police, even if you believe they are violating your rights. Point out that you are not disrupting anyone else's activity and that the First Amendment protects your actions.",
            "Ask if you are free to leave. If the officer says yes, calmly walk away.",
            "If you are under arrest, you have a right to ask why. Otherwise, say you wish to remain silent and ask for a lawyer immediately. Don't say anything or sign anything without a lawyer.",
            "You have the right to make a local phone call, and if you're calling your lawyer, police are not allowed to listen.",
            "You never have to consent to a search of yourself or your belongings. If you do explicitly consent, it can affect you later in court.",
            "Police may \"pat down\" your clothing if they suspect you have a weapon and may search you after an arrest.",
            "Police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances. However, they may order citizens to cease activities that are truly interfering with legitimate law enforcement operations."
          ]
        },
        {
          "title": "What to do if you believe your rights have been violated",
          "items": [
            "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
            "Get contact information for witnesses.",
            "Take photographs of any injuries.",
            "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
          ]
        }
      ]
    },
    {
      "title": "Considerations for People Under Supervision",
      "content": [
        "Everyone has basic rights under the US Constitution and civil rights laws. The ACLU empowers people to understand what their rights are, how to exercise them, and what to do if their rights are violated. The ACLU offers general guides about peaceful protest rights and risks that can come with law enforcement contact. This specialized guide offers additional information for people who are under supervision (in diversion, on probation/parole, participants in a problem-solving court). There are thousands of youths and adults in Nebraska under supervision and persistent racial disparities exist at every stage of the criminal justice system."
      ],
      "subsections": [
        {
          "title": "What is pretrial diversion?",
          "items": [
            "Juvenile pretrial diversion programs are rooted in the fact that some cases are better handled through an informal, non-court process. Juvenile pretrial diversion is a voluntary program available to youth charged with an offense. Youth are referred to a pretrial diversion program by the prosecutor (the county or city attorney) who determines eligibility. Participation diverts the youth from the juvenile justice system into a program that includes a continuum of requirements and services. Juvenile pretrial diversion can be a positive alternative to juvenile court and can provide access to treatment and services and a better outcome. Successful completion of juvenile pretrial diversion program is dismissal or non-filing of the case, which minimizes the risk of a record and collateral consequences later related to education, employment, housing, etc."
          ]
        },
        {
          "title": "What is adult diversion?",
          "items": [
            "Some counties have a pretrial diversion program for some people who have been charged with a crime for the first time or people charged with certain lower-level crimes. If you voluntarily enter diversion based on an offer from the county or city attorney you may be subject to screening, background checks, fees or restitution, community service, educational classes, or treatment programs. You also cannot be convicted of any additional offenses. The length, or term, for a diversion program is generally about six months, but can be up to one year in length. If you do not comply with the terms of pretrial diversion, the original case can be refiled. Successful completion of diversion leads to dismissal or non-filing of the case, which minimizes the risk of a record and collateral consequences later related to education, employment, housing, etc."
          ]
        },
        {
          "title": "What is probation?",
          "items": [
            "Probation is a sentencing option and alternative to jail ordered by a judge instead of or in addition to a jail sentence. While on probation, you serve time in the community under the supervision of the probation department instead of in jail. During this time you remain under the court's supervision and a probation officer has the authority to notify the court if you violate of the conditions of your probation, which can have serious legal consequences. Typical conditions of probation include refraining from further law violations, meeting with probation officers, refraining from the use of drugs and alcohol, being subject to drug or alcohol tests, paying fees/restitution, and completing education and/or treatment programs. Probation can include terms of post-release supervision, or a type of probation supervision that you are subject to after you are released from jail or prison for certain low-level felonies. Probation also describes a suspended sentence, or a term of \"deferred judgement probation\" in which a judge might place you on probation, but order that the case be dismissed when you successfully complete probation."
          ]
        },
        {
          "title": "What is parole?",
          "items": [
            "The words probation and parole are frequently used interchangeably when, in fact, they are not the same thing. Parole always follows a period of incarceration in a state or federal prison. The Board of Parole decides whether someone may be released into the community after they have served the minimum portion of their sentence. Once released, that person is then supervised by a parole officer. Violations of parole are dealt with by the Board of Parole and can carry serious consequences."
          ]
        },
        {
          "title": "What are problem-solving courts?",
          "items": [
            "These specialized court programs operate in district, county or juvenile courts and include programs established for the treatment of problems related to substance use, mental health, for veterans, for young people, individuals reentering the community from incarceration, and domestic violence. Problem-Solving Courts are post plea or post-adjudicatory intensive supervision treatment programs. The purpose of the programs is to reduce recidivism by fostering a comprehensive and coordinated court response using early intervention, appropriate treatment, intensive supervision, and consistent judicial oversight. Problem-Solving Courts in Nebraska operate under a team approach where a judge, prosecutor, defense counsel, coordinator, community supervision officer, law enforcement, and treatment provider(s) work together to design an individualized program. Compliance with treatment and court orders is verified by frequent alcohol/drug testing, close community supervision with home or field visits, may include conditions of curfews or associating with others and responding to requests from law enforcement."
          ]
        },
        {
          "title": "What if I am under 19 while protesting?",
          "items": [
            "You are legally considered an adult at age 19 in Nebraska. In some cases, people who are under 19 when they are arrested will be held in separate facilities for youth, tried in a separate juvenile court, receive different kinds of sentences, may be subject to curfews, and may need a parent/guardian to come forward before they are released. However, Nebraskans as young as 14 years old may be charged and tried as adults for felony offenses and Nebraskans under the age of 16 may be charged and tried as adults for misdemeanor offenses."
          ]
        },
        {
          "title": "What if I am under supervision (in diversion or on probation) when I am protesting?",
          "items": [
            "If you are on supervision of any kind, you should know that additional law enforcement contact carries special risks. Historically and very recently, people peacefully protesting have been met with aggressive police tactics and many times found themselves under arrest. Any additional arrest can risk the positive benefits of your probation, parole, or diversion programs. If you are under supervision, you should discuss these issues with your probation officer and your attorney to learn more about their perspectives. Remember that you have many options to peacefully express yourself in ways that can limit or eliminate the risk of additional law enforcement contact.",
            "Additionally, depending on the terms and conditions of your program, your right to protest may be limited by some conditions of your supervision. For instance, you may be subject to a curfew or you may be subject to a condition that requires you to consent to questioning by law enforcement or to be subject to search and seizure by law enforcement. Your right to protest may be limited more than others not under supervision. If you are arrested while engaging in peaceful protest, you should contact your attorney and then your probation/parole officer right away."
          ]
        },
        {
          "title": "What are other ways to speak out without risking system involvement/arrest?",
          "items": [
            "Generally, you have the right to free speech while under supervision. Protest and peaceful expression can take many forms beyond peaceful protest in public spaces and still make a positive difference. You can consider some of these tools to let your point of view be known and limit your risk of contact with law enforcement and losing the ability to participate in diversion or probation. Here are some examples:",
            "Speak out online",
            "Contact elected officials",
            "Write and submit letters to editor",
            "Express yourself artistically and creatively."
          ]
        },
        {
          "title": "Considerations Related to Immigration Status",
          "items": [
            "The right to protest is guranteed by the First Amendment regardless of immigration status. If protesting, you have the right to:",
            "Peacefully assemble",
            "Photograph or videotape the police",
            "Protest in public places",
            "The Know Your Rights guide linked below is intended to give you the tools and knowledge to participate in any political protests, marches or demonstrations.",
            "Documents (english and spanish):",
            "https://www.aclunebraska.org/sites/default/files/wysiwyg/106449_aclu_-_immigrant_protester_guide_english_proof45814089.pdf",
            "https://www.aclunebraska.org/sites/default/files/field_documents/106449_aclu_-_immigrant_protester_guide_spanish_proof514088.pdf"
          ]
        }
      ]
    }
  ]
}
