{
  "sources": "https://www.acluga.org/sites/default/files/field_documents/aclu_protest_guide_11-7-11.pdf",
  "intro": {
    "title": "Know Your Rights: Free Speech and Assembly",
    "text": "The First Amendment of the United States Constitution and the Georgia Constitution protect the right of all voices to be heard and the right of the people to peaceably assemble and petition their government to address their concerns. Courts have said that the government can set rules regulating these activities when those rules are evenhanded and necessary to protect public safety or to prevent major conflict in the community."
  },
  "sections": [
    {
      "title": "General Guidelines",
      "subsections": [
        {
          "title": "What type of speech and assembly activities are protected by the First Amendment?",
          "items": [
            "Generally, activities such as making speeches, handing out leaflets, holding or attending rallies, carrying posters and peacefully demonstrating are protected by the First Amendment. These activities can be limited by government authorities, as long as those limitations are reasonable in how they restrict the time, place, and manner of the activity."
          ]
        },
        {
          "title": "What other types of free speech activity are constitutionally protected?",
          "items": [
            "The First Amendment covers all forms of communication including spoken words, music, theatre, film, print and dance. It also protects symbolic acts that are intended to express an idea or viewpoint: for example, wearing a particular piece of clothing, carrying a flag, or holding a candlelight vigil."
          ]
        },
        {
          "title": "Can my free speech rights be restricted because of what I say – even if it's controversial?",
          "items": [
            "The First Amendment prohibits restrictions based on the content or viewpoint of a person's speech. However, the First Amendment does not completely protect all types of speech in every circumstance. For example, speech that is directed to incite or produce imminent unlawful action and that is likely to incite or produce such action is not protected. Furthermore, government entities and agents are allowed to place reasonable nondiscriminatory \"time, place and manner\" restrictions on the exercise of First Amendment rights."
          ]
        },
        {
          "title": "What are time, place and manner restrictions?",
          "items": [
            "Time, place and manner restrictions allow governments to place reasonable restrictions on activities that take place in public forums. These restrictions can regulate when activity occurs, where it can occur, and the manner in which it occurs. Restrictions usually do not violate the Constitution when: 1) it furthers an important or substantial governmental interest; 2) the governmental interest is unrelated to the suppression of free expression; and 3) the restriction on First Amendment freedoms is no greater than is essential to the furtherance of that interest. Furthermore, restrictions must ordinarily be \"content neutral\", meaning that they cannot be designed to censor speech."
          ]
        },
        {
          "title": "Do counter-demonstrators have free speech rights?",
          "items": [
            "Yes. Although counter-demonstrators should not be allowed to physically disrupt the event that they are protesting, they generally have the right to be present and to voice their displeasure. The activities of counter-demonstrators are also subject to reasonable time, place and manner restrictions. For example, police may keep antagonistic groups separated in order to maintain public order or prevent harm to others. Such groups should normally be allowed to demonstrate in the same general area unless there is a prevailing public interest such as safety."
          ]
        },
        {
          "title": "Where can people exercise their First Amendment rights?",
          "items": [
            "Generally, in any public forum. Expressive activity is allowed in public forums as long as it does not interfere with the rights of others. For example, demonstrators may not block the way of pedestrians, access to places of business or the flow of traffic. Government may regulate how these activities take place through reasonable time, place and manner restrictions, but may not generally base regulation on the content or message of the activity."
          ]
        },
        {
          "title": "What is a \"public forum\"?",
          "items": [
            "A public forum is a location generally open to the public and used for the communication of views on political and social issues; some examples are sidewalks, public areas of bus and airport terminals, public auditoriums, fairgrounds, plazas, stadiums, parks, courts and legislative buildings. First Amendment activities cannot overly interfere with the normal use of the location. A public forum may also be a location related in some way to the activity, such as the actual or symbolic target of the protest – for example, citizens opposed to legislation having a rally at the State Capitol. Courts have ruled that certain forums (for example, a military base) can be closed to most or all speech activity due to their \"special functions.\" Such locations may allow leafletting, but prohibit other activities such as rallies or picketing."
          ]
        },
        {
          "title": "What about schools, universities and lobbies of public buildings?",
          "items": [
            "Lobbies are not always open to speech activities. However, if they are made available for political campaigning, artistic performances, etc., they must be made available for other similar free speech activities. Note that sidewalks abutting but not on school or other property are public forums.",
            "Public schools (secondary and below): The government can prohibit protest activities by non-students on school grounds while school is in session if the event interferes with school activities (such as too much noise or too many people).",
            "Public colleges and universities: Generally, protest activities on the public areas of state university property are entitled to broad First Amendment protection.",
            "Private schools: Private schools are private property."
          ]
        },
        {
          "title": "What about private property?",
          "items": [
            "When it comes to private, as opposed to public property, First Amendment protections are much more limited. Private property owners have the right to control access to their property and may require people to leave at their discretion. If persons engage in speech activities on private property against the wishes of the owner, they may be subject to arrest and prosecution. It is advisable to obtain permission from the property owner prior to engaging in activity on private property. Please check with the management of a private facility prior to engaging in free speech activities at those locations."
          ]
        }
      ]
    },
    {
      "title": "Permits",
      "subsections": [
        {
          "title": "Do we need to get a permit?",
          "items": [
            "In some locations, groups will need to obtain a permit before holding rallies or demonstrations. Courts have said that some permit requirements for groups are permissible to ensure public safety and that activities are peaceful. Information about permit requirements can be provided by the controlling government entity for each jurisdiction. Permit requirements, however, must be specific and cannot distinguish between groups or speakers and cannot be denied based on the content of the message. Furthermore, permit requirements cannot be unreasonably vague and must sufficiently define the conditions for obtaining a permit. Individual protesters (not part of a group) do not need a permit. Check with local government agencies to see if you need a permit, or look for the regulations on-line. If you have been denied a permit, contact the ACLU of Georgia."
          ]
        },
        {
          "title": "What about marches?",
          "items": [
            "Generally, marches are allowed on public sidewalks or streets. Governments may regulate the time, place and manner of the event to avoid traffic problems and protect public safety. Check to see if you need a permit."
          ]
        }
      ]
    },
    {
      "title": "Signage",
      "subsections": [
        {
          "title": "Can the size, type, or use of signs and banners be restricted?",
          "items": [
            "Yes, if it is a reasonable time, place and manner restriction. For example, the size, construction and/or placement of signs can be regulated in order to prevent signs from creating a safety or traffic hazard."
          ]
        }
      ]
    },
    {
      "title": "Police Interaction",
      "subsections": [
        {
          "title": "What should I do if approached by a police officer?",
          "items": [
            "First, don't argue! Be courteous and comply with the officer's instructions. If you have the opportunity to do so and the officer is willing to listen to you, then you may explain to him that you are lawfully exercising your First Amendment rights and request instructions about how you may continue to exercise those rights. Explain that you are not disrupting anyone else's activities and that your activity is protected by the First Amendment. You may also ask to speak with a supervisory officer. If the officer is unwilling to listen to you, then you should immediately comply with his instructions. Failure to do so may result in your arrest and removal from the scene. You will not be convicted if a court later determines that your First Amendment rights were violated. If you feel that you have been unlawfully denied the ability to exercise your First Amendment rights, contact the ACLU of Georgia."
          ]
        },
        {
          "title": "Police Interaction Don'ts",
          "items": [
            "Get smart with police officers or use bad language",
            "Tell the police that you know they are wrong",
            "Make sudden movements or place your hands where police officers can't see them",
            "Argue with instructions that police officers give you",
            "Touch a police officer",
            "Forget that you have the right to an attorney once you are placed under arrest",
            "Run from the police",
            "Interfere with the police",
            "Exit your vehicle without permission from the officer",
            "Grant permission for a search of your person, vehicle, office or home",
            "Resist police officers ordering you to submit to a search or arrest"
          ]
        },
        {
          "title": "Police Interaction Do's",
          "items": [
            "Comply with instructions from police officers",
            "Remember badge numbers and names of police officers",
            "Remember that when you step out of your vehicle, you are on video camera, and the contents of that video can and will be used against you",
            "Remain calm, cool and collected",
            "Address officers respectfully",
            "Keep your hands where police can see them at all times",
            "Provide police officers with your name and identification if requested",
            "Ask for a lawyer if you are held and questioned",
            "Make a complaint about any police misconduct"
          ]
        }
      ]
    },
    {
      "title": "Contact Information",
      "content": [
        "American Civil Liberties Union of Georgia",
        "1900 The Exchange, Suite 425",
        "Atlanta, Georgia 30339"
      ]
    }
  ]
}
