{
  "sources": "https://www.aclu-wa.org/pages/know-your-rights-guide-protests",
  "intro": {
    "title": "Know Your Rights Guide: Protests",
    "text": "This guide covers the legal protections you have while protesting or otherwise exercising your free speech rights in public places. Although some of the legal principles are firmly established, as with many areas of law, free speech law is complex and continually developing. Generally speaking, you are free to exercise your right to protest, but the government may impose restrictions if you are infringing on the rights or safety of others."
  },
  "sections": [
    {
      "title": "Where, when, and how can I protest?",
      "subsections": [
        {
          "title": "Public and private spaces",
          "items": [
            "Your rights are strongest in what are known as \"traditional public forums,\" such as streets, sidewalks, and parks. You also likely have the right to speak out on other public property, like plazas in front of government buildings, as long as you are not blocking access to the government building or interfering with other purposes the property was designed for.",
            "Private property owners can set rules for speech on their property. The government may not restrict your speech if it is taking place on your own property or with the consent of the property owner.",
            "Counter-protesters also have free speech rights. Police may not treat protesters and counter-protesters differently based on their messages."
          ]
        },
        {
          "title": "Government restrictions",
          "items": [
            "The government may impose reasonable restrictions on the time, place, and manner of speech, but these restrictions cannot be based on the content of the speech. For example, speech may be restricted if it is very loud in a residential area at 2:00 a.m. On the other hand, the government may not prevent a protest because it has an anti-war message.",
            "Speech (and protest) at certain \"sensitive areas,\" such as health care facilities, abortion clinics, military bases, and airport terminals, may also be subject to reasonable time, place, and manner restrictions. For example, near health care facilities, there can be rules about not blocking entrances and not making too much noise."
          ]
        }
      ]
    },
    {
      "title": "Permits and requirements",
      "subsections": [
        {
          "title": "Do I need a permit?",
          "items": [
            "It depends. The government is not allowed to require permits for protesting, leafleting, or signature-gathering on public sidewalks when these activities don't hinder traffic, create a risk to public safety, or significantly compete with others' uses of the space.",
            "If you plan to march in the streets, many cities require permits if the march will block traffic, and the rules for obtaining permits and enforcement of permit requirements vary by jurisdiction. If you march without a permit and block traffic while refusing an order from police to get out of the street, you could be arrested or detained. If you intentionally block traffic as an act of civil disobedience, you could face criminal charges.",
            "You should check your local ordinances for specific requirements if you are planning a large event that will block vehicle or pedestrian traffic. If a permit is required, the rules for obtaining a permit must be laid out in advance and cannot be different based on the content of the speech or the focus of the protest."
          ]
        },
        {
          "title": "Breaking news exception",
          "items": [
            "The courts have recognized an exception to permit ordinances for \"breaking news.\" In a situation where breaking news causes activists to protest in response, the rules for permits (such as requiring application for a permit a certain number of days prior to the protest) may not apply."
          ]
        },
        {
          "title": "Fees and insurance",
          "items": [
            "The government may impose a nominal permit fee to cover administrative expenses of processing a permit application and/or expenses related to the event. Fees must not be based on the content of the speech, and permit schemes must not rely too heavily on the discretion of officials to determine fee amounts.",
            "The courts have invalidated laws that require obtaining insurance or paying indemnification as a condition of obtaining the permit when the amount of insurance demanded is not narrowly tailored, is not content neutral, or leaves too much discretion to government officials. If you believe the government is placing too great of a burden on your right to free expression through unreasonable enforcement of a permit ordinance (e.g., unreasonable delay, cost, or restrictions), contact the ACLU-WA."
          ]
        },
        {
          "title": "Noise restrictions",
          "items": [
            "There could be. It is common for governments to require permits for protests that use amplification devices. Check your local ordinances. The government cannot ban all noise-amplifying devices, but there may be reasonable time, place, and manner limits which apply to the volume of your free speech. For example, the government may restrict the use of loudspeakers during night hours when people expect quiet, but use of drums or amplification equipment would not be a problem during the day and in a location where there is already a lot of noise."
          ]
        }
      ]
    },
    {
      "title": "Special rules for government property",
      "content": [
        "Different kinds of government property are treated differently. Free speech rights are the greatest in government-owned properties that are traditionally open to public expression and assembly, such as sidewalks, streets, and parks. In other locations, such as inside government buildings or on government property where there is a significant security concern (like a military base), the government can limit or even ban speech and protest rights.",
        "Government buildings: Free speech activities may ordinarily take place on sidewalks outside of government buildings and on some public plazas, but not all. Other areas in and around the building (including sidewalks on government property) may be off-limits or may require a permit.",
        "Military bases: The Supreme Court has ruled that no one has a right to protest on military bases, even if the person is a member of the military. However, protests may be permissible in public spaces, such as the sidewalk, if they are outside a military base.",
        "Schools: Picketing or leafleting near school grounds (for example, on the public sidewalk in front of the school) is constitutionally protected, but administrators may restrict access to public school property during school hours to ensure safety. In addition, students are allowed to engage in symbolic protest on campus that does not interrupt educational activities, like wearing an armband to protest war.",
        "City Council Meetings: Protesters may be ejected from city council meetings for speech that disrupts or impedes the meeting, but a city cannot define a \"disturbance\" in any way it wants. The disruption has to be an actual disruption. Silent acts or quiet speech (like audience members putting their thumbs down) that do not actually impede the meeting are not grounds for ejection. Speakers can be stopped in governmental public forums if moderators believe the speech has been irrelevant, repetitive, or too long. Speech disrupts a government meeting if the institution is unable to complete its business in a reasonably efficient manner.",
        "State Parks: State parks may require reservations or permits for large demonstrations, or for use of sound equipment. Apply for a permit from the park agency well in advance of the event."
      ]
    },
    {
      "title": "What can I do or not do while protesting?",
      "subsections": [
        {
          "title": "Symbolic speech",
          "items": [
            "You can burn the American flag. The Supreme Court holds that burning the American flag is a constitutionally protected form of expression.",
            "You can hang the American flag upside down. The United States Supreme Court has held that a state cannot criminally charge a person for hanging an American flag upside down on private property in protest."
          ]
        },
        {
          "title": "Limits to speech",
          "items": [
            "Generally, the Constitution protects everyone's right to express their views, even if those views are unpopular. However, the courts have allowed punishment for speakers who make true threats or incite violence.",
            "True threats: communicating an intention to inflict imminent bodily harm against another person, where a reasonable person would believe the threat was likely to be carried out.",
            "Incitement: encouraging immediate acts of violence under circumstances where the encouragement goes beyond strong rhetoric and is intended to cause a riot or violence and is likely to cause serious harm through a riot or violence."
          ]
        },
        {
          "title": "Hostile reactions from others",
          "items": [
            "You are not legally responsible. The speaker is not responsible for the presence of hecklers or angry listeners; their hostile actions do not make the speaker's speech illegal. The presence of hecklers or counter-demonstrators is not, by itself, enough to justify an order to disperse the crowd or arrest the speakers. The government also may not increase permitting costs based on the expectation that counter-demonstrators will be present."
          ]
        }
      ]
    },
    {
      "title": "Interactions with police",
      "subsections": [
        {
          "title": "Criticizing police",
          "items": [
            "You can criticize the police. The First Amendment grants individuals the freedom to verbally criticize police actions as long as the language does not amount to fighting words (words that would lead someone to think you want to physically fight the police). Courts have upheld this constitutional protection in many circumstances, and for many different offensive words and statements. Even when words directed at police may be \"disrespectful, discourteous, and annoying, they are nonetheless constitutionally protected.\""
          ]
        },
        {
          "title": "Recording police",
          "items": [
            "You can film the police on your cell phone or with a camera. Washington state and federal courts have upheld the right to record or observe the police performing their official duties in public, so long as the conduct does not interfere with police doing their job. Individuals should keep a reasonable distance from police and take care to not actually interfere with police activities while recording.",
            "When you are lawfully present in any public space, you have the right to photograph anything in plain view, including federal buildings and the police.",
            "Police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances. However, they may order citizens to cease activities that are truly interfering with legitimate law enforcement operations."
          ]
        },
        {
          "title": "Dispersal orders",
          "items": [
            "The police are charged with safeguarding the public during a demonstration, but they are also required to protect free speech rights. The police may not break up a gathering unless there is a clear and present danger of riot, disorder, interference with traffic on public streets, or other immediate threat to public safety. If the police issue an order to disperse, you must obey it or face the possibility of arrest.",
            "Shutting down a protest through a dispersal order must be law enforcement's last resort. Police may not break up a gathering unless there is a clear and present danger of riot, disorder, interference with traffic, or other immediate threat to public safety.",
            "If officers issue a dispersal order, they must provide a reasonable opportunity to comply, including sufficient time and a clear, unobstructed exit path.",
            "Individuals must receive clear and detailed notice of a dispersal order, including how much time they have to disperse, the consequences of failing to disperse, and what clear exit route they can follow, before they may be arrested or charged with any crime."
          ]
        },
        {
          "title": "Arrests",
          "items": [
            "Even if you view your activity as lawful, there's a chance that the police will regard it as breaking a law. Remember, if you disobey an order you believe is unconstitutional, you may still be arrested and charged (even if the officer is wrong). Alert the ACLU-WA if you believe an official order has unconstitutionally restricted your right to protest or if you have been arrested in violation of your civil liberties."
          ]
        },
        {
          "title": "Chemical agents and projectiles",
          "items": [
            "Police cannot use chemical agents and projectiles against protesters. Historically, Seattle has been the site of violent police repression of protests. This was true in 1999 and in 2020. Most recently, the ACLU-WA and others successfully challenged Seattle Police's violent response to Black Lives Matter protesters. Police retaliated against and disrupted the protests by using tear gas, pepper spray, flash bang devices, and foam-tip bullets. Protesters won their challenge to the repressive police tactics Seattle employed against them because the court recognized that the chemical weapons police officers used were retaliatory, threatened and caused excruciating pain, and had a chilling effect on the protesters' exercise of their First Amendment freedoms. The court prohibited the City of Seattle's police department \"from employing chemical irritants or projectiles of any kind against persons peacefully engaging in protests or demonstrations.\"",
            "If during a protest you were confronted with chemical weapons by police, contact the ACLU-WA."
          ]
        }
      ]
    },
    {
      "title": "If you are stopped by the police while protesting",
      "items": [
        "Stay calm. Make sure to keep your hands visible. Don't argue, resist, or obstruct the police, even if you believe they are violating your rights. Point out that you are not disrupting anyone else's activity and that the First Amendment protects your actions.",
        "Do not run or physically resist. Police can be dangerous.",
        "Ask if you are free to leave. If the officer says yes, calmly walk away.",
        "If you are under arrest, you have a right to ask why. Otherwise, say you wish to remain silent and ask for a lawyer immediately. Don't say anything or sign anything without a lawyer.",
        "You have the right to make a local phone call, and if you're calling your lawyer, police are not allowed to listen.",
        "You never have to consent to a search of yourself or your belongings. If you do explicitly consent, it can affect you later in court.",
        "Police may \"pat down\" clothing if they suspect you have a weapon and may search you after an arrest.",
        "Police officers may not confiscate or demand to view your photographs or video without a warrant, nor may they delete data under any circumstances. However, they may order citizens to cease activities that are truly interfering with legitimate law enforcement operations."
      ]
    },
    {
      "title": "What to do if you believe your rights have been violated",
      "items": [
        "When you can, write down everything you remember, including the officers' badge and patrol car numbers and the agency they work for.",
        "Get contact information for witnesses.",
        "Take photographs of any injuries.",
        "Once you have all of this information, you can file a written complaint with the agency's internal affairs division or civilian complaint board."
      ]
    },
    {
      "title": "Civil disobedience planning",
      "content": [
        "If you are planning an act of civil disobedience (i.e., violating the law), keep in mind that you may be arrested for that act. Prepare accordingly and plan ahead. The National Lawyers Guild may be able to provide legal observers and volunteer attorneys. Be sure to consult the ACLU-WA's \"What To Do If You're Stopped by the Police\" and remember:",
        "You have the right to remain silent. Use it. You must give your name and address but don't say anything else.",
        "You have the right to legal counsel. Ask for an attorney. Don't discuss your case with the police without consulting your attorney.",
        "You have the right to go into court and see a judge the next court day after you have been detained. Assert this right. Some arrested persons may be released before this time, with or without bail."
      ]
    }
  ]
}
