{
  "sources": "https://www.acluhi.org/en/know-your-rights/first-amendment-toolkit",
  "intro": {
    "title": "First Amendment Toolkit",
    "text": "\"Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\" – First Amendment to the U.S. Constitution. This Toolkit provides basic information about how to protest lawfully."
  },
  "sections": [
    {
      "title": "Expressive Activity and Your Rights",
      "subsections": [
        {
          "title": "What is \"expressive activity\"?",
          "items": [
            "The First Amendment protects speech (\"expressive activity\") where the main goal is expression, dissemination, or communication of political, religious, philosophical, or ideological opinions, views, or ideas and where no fee is charged to participate or attend.",
            "There is no single definition of \"expressive activity,\" but it's often something like this: \"Expressive activity\" means speech or conduct, the principal object of which is the expression, dissemination, or communication by verbal, visual, literary, or auditory means of political, religious, philosophical, or ideological opinions, views, or ideas. Expressive Activity includes, but is not limited to, public oratory and the distribution of literature."
          ]
        },
        {
          "title": "Your right to protest",
          "items": [
            "The right to protest government actions publicly is protected by the First Amendment to the U.S. Constitution. This right is not absolute. Even peaceful, non-violent protestors leading a march or waving picket signs may be subject to arrest if they trespass, harass or hinder others in their own lawful activities. If your protest involves several people, it may require a permit (which the government may not make too expensive or deny discriminatorily).",
            "This Toolkit is designed to provide some information to help you conduct a lawful protest. To better protect yourself from arrest, consult an attorney or the government agency in charge of the location where you want to protest ahead of time. Once a protest is underway, do not harm others or put them in danger, and obey the orders of the police. Never forget that attacking a police officer, even verbally, may itself be a crime."
          ]
        },
        {
          "title": "6 key things to know if you choose to protest",
          "items": [
            "Generally, you have a right to stand or march on sidewalks without a permit, as long as you are obeying traffic signals and not blocking the sidewalk. You may be asked to move if several small groups gather and the sidewalk is blocked.",
            "Generally, small groups can use City parks without a permit, but getting a permit may be a good idea even if you don't technically need one.",
            "If you march in the street without a permit, you risk arrest.",
            "If you witness or experience what you believe to be police misconduct, note officers' badge numbers, names and physical descriptions.",
            "The First Amendment does not protect \"civil disobedience.\"",
            "If ordered to disperse, do so or you may be arrested."
          ]
        }
      ]
    },
    {
      "title": "Specific Activities and Regulations",
      "subsections": [
        {
          "title": "Can I carry signs? What about signs along roads and on overpasses?",
          "items": [
            "Almost always, the First Amendment will protect your right to hold signs (as long as you are legally allowed to stand/sit wherever you happen to be holding the sign). You can have signs on sticks, just use your common sense and be careful not to hit anything or anyone.",
            "Generally, you can carry signs along roads and on overpasses, but you cannot place any signs on the road. You may not hang a sign from an overpass. You may wish to contact the State Dept. of Transportation, (808) 587-2220 with questions."
          ],
          "note": "UPDATE (2/3/12): While we are not aware of any regulations prohibiting an individual from holding a protest sign on public property, you may want to contact the Honolulu Department of Transportation Services with questions about signs and roadways, the Department of Parks and Recreation for questions about signs in parks, and/or the Department of Planning and Permitting for questions about signs on private property."
        },
        {
          "title": "Can I distribute handbills?",
          "items": [
            "Distributing handbills on public sidewalks or in parks is generally allowed without a permit. However, the City has rules that restrict handbilling in certain areas of Waikiki."
          ]
        },
        {
          "title": "Can I put a small table on a public sidewalk?",
          "items": [
            "You are allowed to have a table (or another piece of portable furniture) on the sidewalk to display literature or other expressive material. Your table may not block the sidewalk and each person's table can be no bigger than 5' x 2' (or a total of 10 square feet).",
            "You are allowed to place a table on state property without a permit for the distribution of literature. However, you may obtain a permit in order to reserve a specific space on state property. For information about obtaining a permit to use state property, please see the applicable section below."
          ]
        },
        {
          "title": "Can I use chalk on a public sidewalk?",
          "items": [
            "It's unclear, but if you're told you can't, contact us."
          ]
        },
        {
          "title": "Can I use amplified sound?",
          "items": [
            "In general, you cannot use sound amplifying devices without a permit. You will need a permit from the Chief of Police, and possibly the City's Department of Parks and Recreation if using a city park.",
            "For state property, including harbors, all uses of sound amplification equipment or noise exceeding 75 decibels are prohibited unless a permit has been obtained from the appropriate permitting authority."
          ]
        },
        {
          "title": "Can I have an overnight demonstration, at a park, even if it is closed at night and does not allow camping?",
          "items": [
            "No, you will be subject to arrest."
          ]
        },
        {
          "title": "Can I sleep on the sidewalk?",
          "items": [
            "No, you may be cited and fined up to $50 and/or imprisoned for up to 30 days."
          ]
        },
        {
          "title": "Can I put a tent on public property?",
          "items": [
            "It depends. For a city park, you will need a permit, obtainable from the Parks Department.",
            "For other public areas, contact the managing authority, for instance the State Department of Transportation, or the Department of Land and Natural Resources."
          ]
        },
        {
          "title": "Can a protest \"occupy\" a public building?",
          "items": [
            "No. Unless you have a permit, you cannot \"occupy\" public space (other than being present there consistently when it is open). You may be arrested if you refuse to leave at closing time."
          ]
        },
        {
          "title": "Do police have to give me a warning before I'm arrested?",
          "items": [
            "No, although they might do so."
          ]
        },
        {
          "title": "Can I engage in civil disobedience?",
          "items": [
            "\"Civil disobedience\" is an intentional violation of a law that the person believes to be unjust, with the goal of changing the law or policy. The First Amendment does not protect civil disobedience. You should expect to be arrested, and consult an attorney, if you plan to engage in civil disobedience."
          ]
        }
      ]
    },
    {
      "title": "Legal Disclaimer",
      "content": [
        "IMPORTANT DISCLAIMER: This is general information, not legal advice, and the information about \"City\" property only applies to the City & County of Honolulu. Laws are always subject to change. This document discusses the ACLU's understanding of what the law is; it does not mean that the ACLU necessarily agrees with the law. When in doubt, consult an attorney."
      ]
    }
  ]
}
