{
  "sources": "https://www.aclu-mn.org/sites/default/files/field_documents/protestrights.pdf",
  "intro": {
    "title": "Know Your Rights: Criminal Issues at Protests",
    "text": "You have the right to engage in peaceful, protest activity in Minneapolis and St. Paul. However, the cities and the police department impose certain restrictions on these activities to ensure public safety. This card guides you basic information on your rights as a protester at demonstrations in Minnesota and what do to do if you are stopped, arrested, or injured by law enforcement."
  },
  "sections": [
    {
      "title": "Your Rights As A Protester",
      "subsections": [
        {
          "title": "",
          "items": [
            "You have the right to protest peacefully in public areas like streets, sidewalks or parks. But, the government can have 'time, place and manner' restrictions on speech. You may need to obtain a permit. Restrictions are permissible as long as they are reasonable but not permissible if based on the message content of a certain speaker or group.",
            "Generally, you have the right to distribute literature, hold signs and collect petition signatures on sidewalks or in front of government buildings as long as you do not disrupt other people, force passersby to accept leaflets or obstruct traffic.",
            "Drumming, dancing, singing and chanting are First Amendment protected activities. Street performers, mimes or puppeteers are also protected."
          ]
        }
      ]
    },
    {
      "title": "Limits On Your Free Speech Protest Rights",
      "subsections": [
        {
          "title": "",
          "items": [
            "The First Amendment does not protect free speech if it violates laws such as trespassing, disobeying or interfering with a lawful order by a law enforcement officer.",
            "Inflammatory speakers can't be punished for arousing an audience, but can be arrested for incitement by advocating imminent violence or provoking people to violate the law.",
            "While you have a right to hold signs, certain restrictions apply. In St. Paul, there are size restrictions on the wood, metal or other materials you can attach to your sign.",
            "False statements about public officials and obscene speech are unprotected.",
            "In Minneapolis and St. Paul, excessive or disturbing noise is considered a public nuisance. St. Paul restricts the use of sound amplification equipment at levels exceeding federal, state or city limits. However, they also have a process for obtaining a variance.",
            "Demonstrators who engage in civil disobedience — peaceful, but unlawful, activities as a form of protest — are not protected from prosecution by the First Amendment.",
            "If you endanger others while protesting, you can be arrested. A protest that blocks vehicular or pedestrian traffic is illegal without a permit.",
            "You do not have the right to block building entrances or physically harass people or engage in speech activity on private property, including outdoor malls, without consent of the owner. You do not have the right to remain on private property if asked to leave by the property owner."
          ]
        }
      ]
    },
    {
      "title": "What To Do If You're Stopped By Law enforcement",
      "subsections": [
        {
          "title": "",
          "items": [
            "Stay calm and in control of your words, body language and emotions.",
            "Don't get into an argument with law enforcement.",
            "Never bad-mouth a law enforcement officer.",
            "Remember, anything you say or do can be used against you.",
            "Keep your hands where law enforcement can see them.",
            "Don't run. Don't touch any law enforcement officer.",
            "Don't resist, even if you believe you are innocent.",
            "Don't complain at the scene. Don't tell the law enforcement they're wrong or that you're going to file a complaint.",
            "Do not make any statements regarding the incident.",
            "Ask for a lawyer immediately if you are arrested.",
            "Remember officers' badge and patrol car numbers.",
            "Write down everything you remember ASAP.",
            "Try to find witnesses, and their names and phone numbers.",
            "If you are injured, take photos of the injuries ASAP but get medical attention first."
          ]
        }
      ]
    },
    {
      "title": "If You're Stopped For Questioning",
      "subsections": [
        {
          "title": "",
          "items": [
            "Law enforcement may stop and detain you only if they suspect that you have committed, are committing or are about to commit a crime.",
            "Ask if you are under arrest or free to leave. If arrested, you have a right to know why.",
            "Unless suspected of a crime, law enforcement can't lawfully require you to identify yourself or produce identification. However refusal could lead to your arrest even if it's unjustified.",
            "Blanket searches of bags at demonstrations are lawful only if there is a potential threat. However if you do not wish to have your bag searched, you should be allowed to leave the area.",
            "If law enforcement ask to frisk and \"pat down\" your outer clothing, do not physically resist. But make it clear that you do not consent to further search",
            "Do not insult law enforcement or run away, even if the situation seems unfair. You could be arrested."
          ]
        }
      ]
    },
    {
      "title": "If You're Arrested Or Taken To A Police Station",
      "subsections": [
        {
          "title": "",
          "items": [
            "You have the right to remain silent and to talk to a lawyer.",
            "Only give your name and address to the law enforcement.",
            "Make your defense in court with your lawyer present.",
            "If you have a lawyer, ask to see your lawyer immediately. If you can't afford a lawyer, you are entitled to a free, court-appointed lawyer. Don't say anything without a lawyer.",
            "Ask law enforcement to contact a family member or friend.",
            "Anything you say over the phone at the precinct may be recorded or listened to. So do not discuss your case.",
            "Do not make any decisions in your case until you have talked with a lawyer.",
            "You must be produced before a judge no more than 36 hours after the arrest. The 36 hours do not include the day of the arrest, weekends or legal holidays.",
            "If arrested, a judge must make a probable cause determination on the arrest's validity within 48 hours of the arrest, not including the day of the arrest, weekends or legal holidays."
          ]
        }
      ]
    },
    {
      "title": "Criminal Laws Impacting Demonstration Activity",
      "subsections": [
        {
          "title": "",
          "items": [
            "You must give your name to law enforcement if you are under arrest or reasonably suspected of a crime. If you do not, you might be detained until they identify you.",
            "Illegal trespassing includes interfering with signs that mark a legal boundary, entering private property without a claim of right, or refusing to leave when the owner demands it.",
            "Minnesota law forbids you from wearing a mask, or other disguise to hide your identity unless it is based on religious beliefs, entertainment, medical treatment or the weather.",
            "You can be arrested for terroristic threats for directly or indirectly threatening violence in order to terrorize others or cause an evacuation of a building, place of assembly, vehicle or transportation facility.",
            "It is a crime to intentionally obstruct, interfere with or make passage dangerous on any public right-of-way.",
            "You can be charged with disorderly conduct for disturbing an assembly, speech or conduct that is likely to provoke a violent reaction, or inciting an immediate breach of the peace.",
            "A group of three or more people can be arrested for unlawful assembly for disorderly conduct that unreasonably interferes with or obstructs another's use of public or private property.",
            "You can be arrested for not leaving an unlawful assembly when ordered by law enforcement.",
            "Intentional acts or threats of unlawful force to a person or property by three or more people is considered an illegal riot."
          ]
        }
      ]
    }
  ]
}
